{
  "News": [
    {
      "id": "672",
      "title": "Google Trends Data Reflects Rising Interest in BRICS Bloc and De-Dollarization Searches ",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics1234-768x432.jpg",
      "description": "Set to take place in less than two months, the upcoming BRICS Summit in Johannesburg, scheduled for August 22 to 24, has captured global attention. Anticipation is mounting as ministers from the BRICS countries convene to explore potential avenues for expanding the bloc&#8217;s membership and introducing a unified currency. Recent data from Google Trends reveals [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/google-trends-data-reflects-rising-interest-in-brics-bloc-and-de-dollarization-searches/"
    },
    {
      "id": "652",
      "title": "Bitcoin, Ethereum Technical Analysis: BTC Remains Near $30,000, as Traders Prepare for Key US Economic Data",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1457893238-768x432.jpg",
      "description": "After a recent slip, bitcoin moved back above $30,000 on Monday, ahead of a key week of U.S. economic data, with the headline being the inflation report. Inflation is expected to drop to 3.1% in June, which would be a nearly two-year low. Ethereum also slipped on Monday, remaining below $1,900. Bitcoin Bitcoin (BTC) started [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-remains-near-30000-as-traders-prepare-for-key-us-economic-data/"
    },
    {
      "id": "632",
      "title": "Iran Looking to Replace Dollar With Dinar in $10 Billion Trade With Iraq",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1063319654-768x432.jpg",
      "description": "Iran’s government considers employing the Iraqi dinar in bilateral trade with Iraq in a bid to further curtail the dominance of the U.S. dollar. The annual turnover between the two neighboring nations exceeds $10 billion with millions of pilgrims and health tourists crossing the border each year. Iran and Iraq Can Reduce Dollar Dominance by [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/iran-looking-to-replace-dollar-with-dinar-in-10-billion-trade-with-iraq/"
    },
    {
      "id": "612",
      "title": "Latam Insights — Bolivia Calls for De-Dollarization, Reserve Drops Fiat Services",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1827932012-768x432.jpg",
      "description": "Welcome to Latam Insights, a compendium of Latin America&#8217;s most relevant crypto and economic news during the last week. In this issue, Bolivian President Luis Arce calls for de-dollarization at the Southern Common Market Summit, Reserve drops fiat services in Latam, and Argentina postpones a $2.6 billion IMF payment. Bolivian President Calls for De-Dollarization and [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/latam-insights-bolivia-calls-for-de-dollarization-reserve-drops-fiat-services/"
    },
    {
      "id": "593",
      "title": "SEC States Coinbase Misinteprets Howey Test, Misuses Major Questions Doctrine",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1376249849-768x432.jpg",
      "description": "The U.S. Securities and Exchange Commission (SEC) answered the latest filing of Coinbase by shooting down the arguments presented by the exchange to throw out the ongoing lawsuit. The filing reaffirms the institution&#8217;s jurisdiction on securities laws, explaining that Coinbase misinterprets the Howey test and criticizing the &#8220;major questions doctrine&#8221; usage in the case. SEC [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/sec-states-coinbase-misinteprets-howey-test-misuses-major-questions-doctrine/"
    },
    {
      "id": "592",
      "title": "BLU Mission Forms Strategic Partnership with Unidef to Foster Decentralization",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/b66baeb1-cd50-42bf-8b44-3c352b55f8b5-768x432.png",
      "description": "PRESS RELEASE. Dubai, UAE &#8212; July 10, 2023 – Today, BLU Mission, an organization committed to the growth and integrity of the broader crypto ecosystem, is excited to announce its partnership with Unidef (unidef.org). The collaboration aims to expedite the transition towards a decentralized future. Together, we engage with policy-makers, launch advocacy initiatives, and establish [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/blu-mission-forms-strategic-partnership-with-unidef-to-foster-decentralization/"
    },
    {
      "id": "572",
      "title": "Iowa Resident Scammed of $6,600 in Bitcoin ATM Scheme, Police Launch Investigation",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/goldddd-768x432.jpg",
      "description": "On July 7, 2023, a Clive, Iowa resident fell victim to a scammer posing as a Polk County sheriff&#x2019;s deputy, who coerced the individual into depositing $6,600 into a bitcoin automated teller machine (ATM). The Clive Police Department insists that the scammers utilized cryptocurrencies due to the challenges in tracking these assets. Scammer Poses as [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/iowa-resident-scammed-of-6600-in-bitcoin-atm-scheme-police-launch-investigation/"
    },
    {
      "id": "561",
      "title": "BRICS Gold-Backed Currency Will Benefit Iran, Weaken US Dollar, Iranian Official Says",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/iran-brics-currency-768x432.jpg",
      "description": "An Iranian official has stated that Iran stands to benefit from a gold-backed common BRICS currency. The official further asserted that such a BRICS currency would erode the U.S. dollar&#8217;s dominance and result in increased wealth for Iranians holding gold. “A tremendous change is taking place in the international economy,” the official stressed. Iran Will [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/brics-gold-backed-currency-will-benefit-iran-weaken-us-dollar-iranian-official-says/"
    },
    {
      "id": "541",
      "title": "Treasury Secretary Yellen: BRICS Currency Won’t Threaten US Dollar Dominance",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/yellen-brics-768x432.jpg",
      "description": "U.S. Treasury Secretary Janet Yellen has stated that she does not see the U.S. dollar’s dominance being threatened by any development, including the proposed BRICS currency. Yellen stressed that all the data of which she is aware shows that the dollar is overwhelmingly used in international transactions, emphasizing: “I don&#8217;t think that there is an [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/treasury-secretary-yellen-brics-currency-wont-threaten-us-dollar-dominance/"
    },
    {
      "id": "521",
      "title": "Bitcoin Mining Difficulty Set to Surge: Record-Breaking Increase Looms, Erasing Recent Reduction",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/diff-1-768x432.jpg",
      "description": "According to data recorded on July 9, 2023, Bitcoin&#x2019;s next difficulty adjustment is estimated to rise between 4.74% and 7.7%, erasing the 3.26% reduction that occurred on June 28. Moreover, the total network hashrate achieved a 24-hour all-time high on July 8, reaching 538 exahash per second (EH/s) at block height 797,733. Record-Breaking Bitcoin Difficulty [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/bitcoin-mining-difficulty-set-to-surge-record-breaking-increase-looms-erasing-recent-reduction/"
    },
    {
      "id": "501",
      "title": "Report: Crypto Industry Boasts 10,000 Companies and 190,000 Professionals With a Collective Valuation of $180 Billion",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/cheeecher-768x432.jpg",
      "description": "A recent report released by K33 Research three days ago reveals that as of July 2023, the cryptocurrency industry boasts approximately 10,000 companies, employing an estimated 190,000 crypto professionals. Notably, K33 provides a comprehensive snapshot of the crypto landscape, highlighting that these 10,000 firms possess a collective valuation of $180 billion. K33 Research Unveils Crypto [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/report-crypto-industry-boasts-10000-companies-and-190000-professionals-with-a-collective-valuation-of-180-billion/"
    },
    {
      "id": "481",
      "title": "Eurozone Inflation to Remain Higher Than 2% Target in Next 2 Years, ECB’s Lagarde Admits",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1127436869-768x434.jpg",
      "description": "Inflation in the eurozone has started to decline but the area’s monetary authority expects it to remain above its target in the next two years. The European Central Bank has to do more to bring it down, its governor commented on the backdrop of stable consumer expectations about rising prices during the said period. Euro [&#8230;]",
      "published_date": "2023-07-10",
      "url": "https://news.bitcoin.com/eurozone-inflation-to-remain-higher-than-2-target-in-next-2-years-ecbs-lagarde-admits/"
    },
    {
      "id": "461",
      "title": "World Gold Council’s Mid-Year Report: Gold Set for a Neutral Second Half Under Economic Uncertainty ",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/gold-768x432.jpg",
      "description": "On July 6, 2023, the World Gold Council (WGC) released its 2023 Mid-Year Outlook, revealing that a &#x201C;strong first half for gold is likely to give way to a more neutral H2.&#x201D; According to WGC researchers and market strategists, central banks are &#x201C;nearing the end of their tightening cycles,&#x201D; and the market consensus indicates &#x201C;a [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/world-gold-councils-mid-year-report-gold-set-for-a-neutral-second-half-under-economic-uncertainty/"
    },
    {
      "id": "441",
      "title": "Deflecting Blame — Bank of England Governor Bailey Accuses UK Retailers of Overcharging Customers",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/baillyyjjd-768x432.jpg",
      "description": "After the Covid-19 pandemic, many people believe the implementation of extensive stimulus measures and quantitative easing (QE) policies resulted in an overwhelming surge of inflation that has burdened millions across the globe. While certain individuals attribute this economic turmoil to the actions of central banks, Andrew Bailey, the governor of the Bank of England, firmly [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/deflecting-blame-bank-of-england-governor-bailey-accuses-uk-retailers-of-overcharging-customers/"
    },
    {
      "id": "411",
      "title": "Vitalik Calls Out ‘Centralized World’ Stifling Crypto Innovation, Tim Draper Adjusts BTC Price Prediction, and More — Week in Review",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/untitled-design-768x432.png",
      "description": "&#8220;The real competition is not other chains, it’s the rapidly expanding centralized world that is imposing itself on us as we speak.&#8221; So says Ethereum co-founder Vitalik Buterin addressing the current volatile regulatory realities in crypto. In other news, venture capitalist Tim Draper adjusted the timeframe of his $250K bitcoin price prediction, and a former [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/vitalik-calls-out-centralized-world-stifling-crypto-innovation-tim-draper-adjusts-btc-price-prediction-and-more-week-in-review/"
    },
    {
      "id": "401",
      "title": "Tom Brady Lost $30 Million in FTX Stock After Exchange’s Collapse, Report",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1432729208-768x432.jpg",
      "description": "Former National Football League (NFL) quarterback Tom Brady has reportedly lost tens of millions of U.S. dollars in stock of the failed crypto exchange FTX. Brady is one of several celebrities sued by FTX customers for their endorsements of the collapsed crypto trading platform. Brady and Bündchen Were Paid Millions of Dollars in FTX Stock [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/tom-brady-lost-30-million-in-ftx-stock-after-exchanges-collapse-report/"
    },
    {
      "id": "371",
      "title": "Grayscale Adds Lido’s LDO Token to Defi Fund, Token Becomes Second-Heaviest in Fund’s Basket",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/ldo-768x432.jpg",
      "description": "On July 7, 2023, the digital asset manager Grayscale Investments published an update on three of its funds &#x2014; the Digital Large Cap Fund, the Defi Fund, and the Smart Contract Fund. Although no new tokens were added to two of the funds, Grayscale revealed that it added Lido DAO&#x2019;s native cryptocurrency and governance token, [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/grayscale-adds-lidos-ldo-token-to-defi-fund-token-becomes-second-heaviest-in-funds-basket/"
    },
    {
      "id": "361",
      "title": "CZ Says News of Exec Departures at Binance Is FUD",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/cz-binance-768x432.jpg",
      "description": "Founder of Binance, Changpeng Zhao (CZ), sought to downplay the significance of the exits of some executives at the crypto exchange, describing news about them as “more FUD” (fear, uncertainty, and doubt). The managers are leaving during an ongoing regulatory crackdown on the major coin trading platform that has affected its market share. CZ Comments [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/cz-says-news-of-exec-departures-at-binance-is-fud/"
    },
    {
      "id": "341",
      "title": "Lawyer Outlines What Would Happen if SEC Wins Lawsuit Against Ripple Over XRP",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/deaton-ripple-xrp-768x432.jpg",
      "description": "A lawyer has outlined what he believes to be the most likely outcome if the U.S. Securities and Exchange Commission (SEC) wins against Ripple Labs and XRP is declared a security. He expects Ripple to appeal if the SEC wins, warning: &#x201C;If Ripple loses to the SEC, there won&#x2019;t be any money collected for years.&#x201D; [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/lawyer-outlines-what-would-happen-if-sec-wins-lawsuit-against-ripple-over-xrp/"
    },
    {
      "id": "311",
      "title": "BRICS Bank Official Discusses Common Currency as Reports of Gold-Backed BRICS Currency Gain Attention",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/brics-currency-gold-backed-768x432.jpg",
      "description": "The BRICS Bank’s vice president and chief financial officer has shed light on the economic bloc&#8217;s aspiration to develop a common BRICS currency. His remarks followed recent reports suggesting that Russia has confirmed the BRICS’ plan to introduce a gold-backed common currency, with an official announcement expected to be made during the forthcoming BRICS leaders&#8217; [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/brics-bank-official-discusses-common-currency-as-reports-of-gold-backed-brics-currency-gain-attention/"
    },
    {
      "id": "291",
      "title": "Renowned Investor Jim Rogers Warns ‘US Is Going to Suffer’ as Dollar’s Value Erodes Further",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/jim-rogers-inflation-debt-768x432.jpg",
      "description": "Veteran investor Jim Rogers, who co-founded the Quantum Fund with billionaire investor George Soros, has warned that &#8220;the worst is yet to come” for the U.S. economy. &#8220;The U.S. is going to suffer&#8221; as the value of the dollar erodes further, he predicted, emphasizing that inflation and the debt problems are going to get worse. [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/renowned-investor-jim-rogers-warns-us-is-going-to-suffer-as-dollars-value-erodes-further/"
    },
    {
      "id": "281",
      "title": "Democratic Presidential Candidate Robert Kennedy Jr Holds Up to $250,000 in Bitcoin, Records Show",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/krn-768x432.jpg",
      "description": "According to a report published on Friday, Robert F. Kennedy Jr., a Democratic presidential candidate, holds between $100,000 and $250,000 in bitcoin (BTC). The holdings contradict his statements at the Bitcoin 2023 conference in May, where Kennedy claimed he was not an investor. Kennedy&#x2019;s campaign manager maintains that the BTC acquisition occurred subsequent to the [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/democratic-presidential-candidate-robert-kennedy-jr-holds-up-to-250000-in-bitcoin-records-show/"
    },
    {
      "id": "261",
      "title": "JPMorgan Analysts Say Spot Bitcoin ETF Approval Is ‘Unlikely to Be a Game Changer for Crypto Markets’",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/jpm-768x432.jpg",
      "description": "In a report published on Thursday, JPMorgan analysts suggest that the approval of a spot bitcoin exchange-traded fund (ETF) by the U.S. Securities and Exchange Commission (SEC) is &#x201C;unlikely to be a game changer for crypto markets.&#x201D; The market strategists at the American banking giant emphasize that similar spot bitcoin ETFs already exist internationally, but [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/jpmorgan-analysts-say-spot-bitcoin-etf-approval-is-unlikely-to-be-a-game-changer-for-crypto-markets/"
    },
    {
      "id": "241",
      "title": "NFT Sales Witness 23% Decline This Week, Ethereum Dominates With $130 Million in Sales",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/nftsdd-768x432.jpg",
      "description": "During the first week of H2 2023, non-fungible token (NFT) sales witnessed a 23.39% decline compared to the previous week, marking a two-week downward trend. A total of $195.95 million worth of NFT sales occurred, with Ethereum-based NFTs accounting for $130.77 million. NFT Sales Take a Hit: Week-Over-Week Drop of 23% in the First Week [&#8230;]",
      "published_date": "2023-07-09",
      "url": "https://news.bitcoin.com/nft-sales-witness-23-decline-this-week-ethereum-dominates-with-130-million-in-sales/"
    },
    {
      "id": "221",
      "title": "Monero Maintains Stability Amid Crypto Market Volatility, Remains Top Privacy Token With $3B Market Cap",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/monero-768x432.jpg",
      "description": "In the last half-year, there has been a remarkable surge in the value of crypto assets such as bitcoin and ethereum. BTC has skyrocketed by 77%, while ETH has experienced an impressive 44% leap. On the other hand, the leading privacy-focused cryptocurrency, monero (XMR), has displayed a rather unimpressive performance during the initial six months [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/monero-maintains-stability-amid-crypto-market-volatility-remains-top-privacy-token-with-3b-market-cap/"
    },
    {
      "id": "201",
      "title": "Biggest Movers: SOL Surges to 2-Month High on Saturday, Extending Recent Bull Run",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2244456519-1-768x432.jpg",
      "description": "Solana extended recent gains on Saturday, as the token rose for a third straight session to start the weekend. Today’s move came following a breakout of a key price level, despite the global crypto market cap consolidating. Avalanche also rallied, climbing by as much as 10%. Solana (SOL) Solana (SOL) was a notable gainer in [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/biggest-movers-sol-surges-to-2-month-high-on-saturday-extending-recent-bull-run/"
    },
    {
      "id": "181",
      "title": "Bitcoin, Ethereum Technical Analysis: BTC Consolidates to Start Weekend, ETH Remains Below $1,900",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1251778627-2-768x432.jpg",
      "description": "Bitcoin was hovering near the $30,000 level to start the weekend, as markets continued to digest the latest U.S. nonfarm payrolls report. Payrolls came in at 209,000, less than the 225,000 expected, putting slight doubt in a potential July rate hike. Ethereum continued to trade below $1,900 on Saturday. Bitcoin Bitcoin (BTC) started the weekend [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-consolidates-to-start-weekend-eth-remains-below-1900/"
    },
    {
      "id": "171",
      "title": "Central Bank of Russia: Digital Ruble Could Be Launched as Soon as 2025",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2164243381-768x432.jpg",
      "description": "Olga Skorobogatova, first deputy chairman of the Central Bank of Russia, indicated that the launch of the digital ruble, the Russian central bank digital currency (CBDC), could happen in 2025. The pilot test for the CBDC will be organized later this year after the State Duma, the lower house of the Russian parliament, passes the [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/central-bank-of-russia-digital-ruble-could-be-launched-as-soon-as-2025/"
    },
    {
      "id": "141",
      "title": "Report: Zimbabwe Central Bank Begins Gold-Backed Digital Currency ‘Dry Run’",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1211210776-768x432.jpg",
      "description": "According to a report, the Reserve Bank of Zimbabwe has commenced trials, or the &#8220;dry run&#8221; test, for the viability of launching a gold-backed digital currency. Nelson Mupunga, the director of economic research at the central bank, reportedly said the digital currency will act as an alternative to foreign currency. Local Residents&#8217; Insatiable Demand for [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/report-zimbabwe-central-bank-begins-gold-backed-digital-currency-dry-run/"
    },
    {
      "id": "111",
      "title": "New York Federal Reserve and US Banks Complete Programmable Dollar CBDC Test",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1670957740-768x576.jpg",
      "description": "The New York Federal Reserve and a group of financial institutions announced the successful conclusion of a proof-of-concept of the Regulated Liability Network (RLN), which contemplates the introduction of a dollar-based interbank central bank digital currency (CBDC). The test concluded that, using the RLN, the proposed CBDC might allow for near real-time dollar payments and [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/new-york-federal-reserve-and-us-banks-complete-programmable-dollar-cbdc-test/"
    },
    {
      "id": "81",
      "title": "Pop Icon Taylor Swift Signed $100M Deal With Crypto Exchange FTX, New Reports Claim",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/taylor-swift-ftx-768x432.jpg",
      "description": "Taylor Swift, a pop icon and 12-time Grammy Award winner, did sign an agreement with bankrupt cryptocurrency exchange FTX, new reports claim. However, FTX executives reportedly convinced former FTX CEO Sam Bankman-Fried (SBF) to reconsider and abandon the $100-million deal with Swift. Taylor Swift Reportedly Signed Agreement With FTX Taylor Swift, a famous singer-songwriter who [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/pop-icon-taylor-swift-signed-100m-deal-with-crypto-exchange-ftx-new-reports-claim/"
    },
    {
      "id": "51",
      "title": "Arthur Hayes Insists ‘Bitcoin Will Be the Currency’ of Artificial Intelligence",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/btcai-768x432.jpg",
      "description": "In a freshly unveiled blog piece, Arthur Hayes, the former CEO of crypto derivatives platform Bitmex, posits that bitcoin is the prime currency for artificial intelligence (AI). Hayes maintains that moving forward, BTC will be the favored currency for AIs since they &#x201C;must use a system that is available at all times, digital, and completely [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/arthur-hayes-insists-bitcoin-will-be-the-currency-of-artificial-intelligence/"
    },
    {
      "id": "31",
      "title": "BTC’s Year-End Price Projections for 2023 Vary Widely, Ranging From $25K to $40K, While Future Forecasts Extend Into Six-Digit Territory",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/20233333-768x432.jpg",
      "description": "Bitcoin&#x2019;s market performance in the first half of 2023, surging by 80% against the U.S. dollar, has enthusiasts eagerly speculating about its year-end price. Techopedia and Changelly have released price prediction reports with varying estimates, suggesting that bitcoin&#x2019;s value could range from $25,175 to $40,836 per unit by the close of the year. Techopedia vs. [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/btcs-year-end-price-projections-for-2023-vary-widely-ranging-from-25k-to-40k-while-future-forecasts-extend-into-six-digit-territory/"
    },
    {
      "id": "11",
      "title": "Bitcoin’s 2024 Halving Presents New Challenges: A Deep Dive Into the Future of Mining Rewards",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/halv-768x432.jpg",
      "description": "As we wrap up the initial six months of 2023, the Bitcoin network inches closer to a significant milestone &#x2014; the impending block reward halving, which lies just under 300 days ahead. Projections indicate that this event is slated to take place between April 21 and 27, 2024, leading to a substantial reduction of 50% [&#8230;]",
      "published_date": "2023-07-08",
      "url": "https://news.bitcoin.com/bitcoins-2024-halving-presents-new-challenges-a-deep-dive-into-the-future-of-mining-rewards/"
    },
    {
      "id": "10",
      "title": "Blackrock Seeks to Democratize Crypto — CEO Says Bitcoin Can Hedge Against Inflation, Currency Devaluation",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/larry-fink-bitcoin-768x432.jpg",
      "description": "Larry Fink, the CEO of the world&#x2019;s largest asset manager, Blackrock, says bitcoin is an international asset and crypto can be used instead of gold to hedge against inflation, the onerous problems of any country, as well as currency devaluation. Blackrock, which has a near-perfect track record of getting exchange-traded funds (ETFs) approved by the [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/blackrock-seeks-to-democratize-crypto-ceo-says-bitcoin-can-hedge-against-inflation-currency-devaluation/"
    },
    {
      "id": "9",
      "title": "Peter Schiff: The Fed Has Lost Inflation Fight — ‘Markets Just Haven’t Figured That out Yet’",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/fed-schiff-768x432.jpg",
      "description": "Economist Peter Schiff has warned that the Federal Reserve has lost and inflation is about to get worse. “The markets just haven’t figured that out yet,” he cautioned, emphasizing that “We continue to get a lot of weak economic data.” &#8216;The Fed Has Lost&#8217; Economist and gold bug Peter Schiff issued more warnings about the [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/peter-schiff-the-fed-has-lost-inflation-fight-markets-just-havent-figured-that-out-yet/"
    },
    {
      "id": "8",
      "title": "Putin Warns of Increased Financial Crisis Risk — Says Russia Is Being Subjected to Hybrid War",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/putin-sco-768x432.jpg",
      "description": "Russia’s President Vladimir Putin has warned of increased “risks of a new global economic and financial crisis against the backdrop of an uncontrolled debt accumulation by developed countries.” He added that Russia is “being subjected to a hybrid war, with illegitimate anti-Russian sanctions that are unprecedented in scale.” Putin on Financial Crisis and War Russia’s [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/putin-warns-of-increased-financial-crisis-risk-says-russia-is-being-subjected-to-hybrid-war/"
    },
    {
      "id": "7",
      "title": "IMF Working Paper Urges Tax System Overhaul to Tackle Crypto’s Tax Collection Challenges",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/df-768x432.jpg",
      "description": "A research paper published by the International Monetary Fund (IMF) warns that tax collection is significantly more challenging with cryptocurrency assets, and current tax systems are not designed to handle them. The IMF&#8217;s working paper emphasizes that certain crypto assets may not persist in the future, while others that endure become &#8220;fundamental innovations in decentralized [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/imf-working-paper-urges-tax-system-overhaul-to-tackle-cryptos-tax-collection-challenges/"
    },
    {
      "id": "6",
      "title": "Bitwage Purges USDC Payments for US Residents Due to a ‘More Strict Regulatory Climate’",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2148236287-768x432.jpg",
      "description": "Bitwage, a cryptocurrency payroll company, has announced it will remove USDC-based payments for U.S. residents. In an email sent to U.S.-based customers, Bitwage explains removing the second-largest stablecoin by market cap from its platform is related to a &#x201C;more strict regulatory climate&#x201D; in the U.S. regarding crypto. Bitwage Drops USDC Payments in the U.S. Crypto [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/bitwage-purges-usdc-payments-for-us-residents-due-to-a-more-strict-regulatory-climate/"
    },
    {
      "id": "5",
      "title": "Bitcoin, Ethereum Technical Analysis: BTC Falls Below $30,000 Ahead of US Nonfarm Payrolls",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2132501507-2-768x432.jpg",
      "description": "Bitcoin dropped below the $30,000 level on Friday, ahead of the upcoming nonfarm payrolls (NFP) report in the United States. Today&#x2019;s report comes as private sector jobs rose by 497,000 in the last report, double the expected number. Friday&#x2019;s NFP is projected to come in at 225,000. Ethereum hit a one-week low today. Bitcoin Bitcoin [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/bitcoin-ethereum-technical-analysis-btc-falls-below-30000-ahead-of-us-nonfarm-payrolls/"
    },
    {
      "id": "4",
      "title": "Multichain Woes: Users Informed of an ‘Abnormal’ Transfer of Assets to Unknown Address",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_2153075449-768x432.jpg",
      "description": "Users of the cross-chain protocol Multichain were on July 6 informed of an abnormal transfer of lockup assets on the Multichain MPC address to an unknown address. While the Multichain team has urged users to stop using the cross-chain protocol, Binance CEO Changpeng Zhao (CZ) told his followers that the incident does not affect Binance [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/multichain-woes-users-informed-of-an-abnormal-transfer-of-assets-to-unknown-address/"
    },
    {
      "id": "3",
      "title": "Biggest Movers: SOL Hits Fresh 4-Week High on Friday, ADA Snaps Losing Streak",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/shutterstock_1986636659-4-768x432.jpg",
      "description": "Solana was one of Friday&#x2019;s biggest gainers, as the cryptocurrency rose by over 11% during today&#x2019;s session. The move came as markets reacted to June&#x2019;s nonfarm payrolls report, which came in at 209,000, below expectations of 229,000. On the other hand, cardano ended a three-day losing streak. Solana (SOL) Solana (SOL) rallied for a second [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/biggest-movers-sol-hits-fresh-4-week-high-on-friday-ada-snaps-losing-streak/"
    },
    {
      "id": "2",
      "title": "Web3 Gaming Ecosystem Neon Link Announces July 13 for Public Token Sale",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/unnamed-2023-07-07t150123-889-768x432.png",
      "description": "Pioneering Web3 gaming platform Neon Link has announced the launch date of its public token sale, which will commence on July 13, 2023, at 13:00 UTC. The emerging blockchain innovator has created an entire ecosystem to play and develop online games with a community-driven focus at its center. With the release of its platform, new [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/web3-gaming-ecosystem-neon-link-announces-july-13-for-public-token-sale/"
    },
    {
      "id": "1",
      "title": "Gemini Files Lawsuit Against Digital Currency Group and Barry Silbert Alleging Fraud and Deception",
      "image": "https://static.news.bitcoin.com/wp-content/uploads/2023/07/barrrywink-768x432.jpg",
      "description": "After Gemini co-founder Cameron Winklevoss published an open letter to Digital Currency Group (DCG) CEO and founder Barry Silbert, threatening legal action if the firm failed to respond by July 7, Winklevoss announced on Friday that his company had filed a lawsuit against DCG and Silbert in New York. **Editor&#8217;s Note: This article was updated [&#8230;]",
      "published_date": "2023-07-07",
      "url": "https://news.bitcoin.com/gemini-files-lawsuit-against-digital-currency-group-and-barry-silbert-alleging-fraud-and-deception/"
    }
  ],
  "success": 1
}
