{
  "News": [
    {
      "id": "1960",
      "title": "BBC presenter accused of inappropriate and financial misconduct, prompting concerns and calls for investigation",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-980673,resizemode-4,msid-101614356/bbc-presenter-accused-of-inappropriate-and-financial-misconduct-prompting-concerns-and-calls-for-investigation.jpg",
      "description": "A BBC presenter is facing allegations regarding misconduct for allegedly purchasing explicit photos. The news organisation has responded in this matter.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/uk/bbc-presenter-accused-of-inappropriate-and-financial-misconduct-prompting-concerns-and-calls-for-investigation/articleshow/101614356.cms"
    },
    {
      "id": "1959",
      "title": "San Diego Comic-Con 2023 Schedule: The Wheel of Time, Ninja Turtles, Project K, and list of other panels",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-78814,resizemode-4,msid-101615569/san-diego-comic-con-2023-schedule-the-wheel-of-time-ninja-turtles-project-k-and-list-of-other-panels.jpg",
      "description": "A list of some of the best panels to appear at the San Diego Comic-Con 2023, without Marvel, DC Studios and Warner Bros.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/san-diego-comic-con-2023-schedule-the-wheel-of-time-ninja-turtles-project-k-and-list-of-other-panels/articleshow/101615569.cms"
    },
    {
      "id": "1912",
      "title": "Quordle 531, July 9: What are the hints and answers to this Sunday’s word puzzle?",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-229654,resizemode-4,msid-101613096/quordle-531-july-9-what-are-the-hints-and-answers-to-this-sundays-word-puzzle.jpg",
      "description": "Find all the hints and the four answers to today’s word puzzle, the Quordle 531 dated July 9, 2023. These are for the general puzzle and not the sequence.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/quordle-531-july-9-what-are-the-hints-and-answers-to-this-sundays-word-puzzle/articleshow/101613096.cms"
    },
    {
      "id": "1864",
      "title": "China sets wide-ranging rules for almost $3 trillion private investment funds",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-42774,resizemode-4,msid-101612851/china-sets-wide-ranging-rules-for-almost-3-trillion-private-investment-funds.jpg",
      "description": "China has introduced new regulations to govern the $2.9tn private investment fund industry with effect from 1 September. The rules, which were signed by Premier Li Qiang, will protect investors and support innovation by creating a chapter focused on venture capital funds. The new regulations apply to private investment funds with contracting, corporate or partnership forms. ",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/business/china-sets-wide-ranging-rules-for-2-9-trillion-private-investment-funds/articleshow/101612851.cms"
    },
    {
      "id": "1815",
      "title": "Wordle 750: All the clues and right answer to Wordle puzzle of July 9, 2023",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-7662,resizemode-4,msid-101612292/wordle-750-all-the-clues-and-right-answer-to-wordle-puzzle-of-july-9-2023.jpg",
      "description": "Wordle is a daily word puzzle that can be played on the NYT website and the Wordle app. Here are the hints and the answer to today’s Wordle 750, dated July 9, 2023.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/wordle-750-all-the-clues-and-right-answer-to-wordle-puzzle-of-july-9-2023/articleshow/101612292.cms"
    },
    {
      "id": "1765",
      "title": "At least 76 died, 133 injured due to heavy in Pakistan",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-53816,resizemode-4,msid-101611515/at-least-76-died-133-injured-due-to-heavy-in-pakistan.jpg",
      "description": "In the past 24 hours, eight persons were injured, leading the total number of injured people to 133. The total data of 76 death and 133 injured, includes 15 women and 31 children, whereas 78 houses have so far been damaged as torrential rain continued to play havoc across the country. Punjab has the most number of people who died where 48 people were in the heavy rains and 20 lost their lives in Khyber Pakhtunkhwa (KP), five were killed in Balochistan, the NDMA report read.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/at-least-76-died-133-injured-due-to-heavy-in-pakistan/articleshow/101611515.cms"
    },
    {
      "id": "1550",
      "title": "Random shooting in New York City; 87-year-old dies, three others wounded",
      "image": "",
      "description": "In all, the NYPD said there were five shootings carried out during the spree by someone on a scooter, one in Brooklyn and four in Queens. NEW YORK: A scooter-riding gunman killed an 87-year-old man and wounded three others in a string of random shootings that stretched across two New York City boroughs, police said Saturday.\n\nA 25-year-old man was taken into custody without incident and his identity was not revealed by police, Assistant Police Chief Joseph Kenny said at a news conference. A 9 mm handgun with an extended magazine and a scooter were recovered.\n\nThe New York Police Department pulled an image of the gunman from video and sent it to phones of officers, some of whom spotted the suspect about two hours after the first shooting.\n\n“We don’t know the motive. It seems his acts were random,” Kenny said.\n\nIn all, the NYPD said there were five shootings carried out during the spree by someone on a scooter, one in Brooklyn and four in Queens. No one was injured in one of the shootings.\n\nThe shootings began around 11:10 a.m. when someone on a scooter shot a 21-year-old man in the shoulder in Brooklyn. He was brought to a hospital and is expected to survive, police said.\n\nSeventeen minutes later, an 87-year-old man was shot multiple times in the Richmond Hill area of Queens. He later died at a hospital.\n\nShortly afterwards in Queens, witnesses reported a man on a scooter firing randomly into a group of people, although nobody was hurt.\n\nEight minutes later, a 44-year-old man was shot in the face. He was in critical condition at Jamaica Hospital Medical Center.\n\nAbout one minute later, a 63-year-old man was shot in the torso. He was in stable condition at a hospital.\n\nKillings in the nation’s most populous city have risen in recent years to about where they were a decade ago — well below an early-1990s peak. The number of people wounded by gunfire surged in New York City during the pandemic and remains stubbornly high, and the city has also confronted a series of high-profile crimes.\n\nMayor Eric Adams, a former New York City police captain, has stressed the importance of getting guns off the streets.\n\nALSO READ:\n\n\n\tAt least one dead, five wounded after shooting inside Lebanon mosque\n\tPhiladelphia shooting: Father of the bride, teen who tried to save friend among five killed\n\tBaltimore block party shooting victims include more than a dozen minors\n\tKansas shooting hospitalizes 9 victims including 7 people shot and 2 trampled\n ",
      "published_date": "2023-07-09",
      "url": "http://www.newindianexpress.com/world/2023/jul/09/random-shooting-in-new-york-city-87-year-old-dies-three-others-wounded-2592985.html"
    },
    {
      "id": "1549",
      "title": "Condemned building used by homeless people falls in Brazil, killing 14 people",
      "image": "",
      "description": "The building in Recife’s Paulista suburb crumbled in the early hours of Friday, prompting a frantic search for victims. RIO DE JANEIRO: An apartment building condemned for more than a decade but used by homeless people collapsed in Brazil’s northeastern state of Pernambuco, killing 14 people, including six children, firefighters reported Saturday.\n\nThe building in Recife’s Paulista suburb crumbled in the early hours of Friday, prompting a frantic search for victims.\n\nSearchers combed through the rubble with the help of sniffer dogs and rescued two 15-year-old girls and a 65-year-old woman alive, firefighters said. An 18-year-old man was also removed alive, but later died from his injuries.\n\n“Search operations are now focused on the removal of animals,” the fire department said Saturday.\n\nThe building was occupied by homeless people although living there had been forbidden since 2010, the Paulista city hall said in a statement.\n\nCity officials referred to the structure as a “coffin block,” a name given to buildings built on a large scale in the 1970s in the metropolitan region of Recife, the newspaper Folha de Sao Paulo reported.\n\nThe city hall statement said the problem of people using officially closed buildings in Paulista is “chronic.” It said officials raised the issue during a recent visit by President Luiz Inácio Lula da Silva, who is from the northeastern state.\n\nThe collapse in Paulista was the second such tragedy in less than three months in Pernambuco. A building disintegrated in April in neighboring Olinda, causing at least five deaths.\n\nHeavy rains had soaked the Recife region before the building collapsed in Paulista, prompting Pernambuco’s water and climate agency to post an alert for the metropolitan area.\n\nA Presbyterian church near the site of the fallen building was offering housing assistance to families who had been living there, city officials said. The church was also collecting donations of food, clothes, mattresses, water and hygiene products, officials added. ",
      "published_date": "2023-07-09",
      "url": "http://www.newindianexpress.com/world/2023/jul/09/condemned-building-used-by-homeless-people-falls-in-brazil-killing-14-people-2592989.html"
    },
    {
      "id": "1415",
      "title": "Germany: 22 officers injured in Giessen following unrest, police say",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-31706,resizemode-4,msid-101605517/germany-22-officers-injured-in-giessen-following-unrest-police-say.jpg",
      "description": "According to ZDF, the city of Giessen attempted to prevent the festival from happening this year, but the ban was overturned by a municipal court. Hessen police further stated that a total of 1,000 policemen from several departments had been dispatched and that the situation was ongoing, as per CNN. Hessen police said, \"There are currently no concrete figures on the number of people injured or detained.\"",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/germany-22-officers-injured-in-giessen-following-unrest-police-say/articleshow/101605517.cms"
    },
    {
      "id": "1211",
      "title": "Hugh Jackman in Deadpool 3: Will Wolverine wear the iconic yellow and blue costume? Here’s what we know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-10406,resizemode-4,msid-101603018/hugh-jackman-in-deadpool-3-will-wolverine-wear-the-iconic-yellow-and-blue-costume-heres-what-we-know.jpg",
      "description": "Hugh Jackman will reprise his role as Wolverine in Deadpool 3, and there are rumors suggesting that Logan might finally don his iconic costume and mask as depicted in the comic books.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/hugh-jackman-in-deadpool-3-will-wolverine-wear-the-iconic-yellow-and-blue-costume-heres-what-we-know/articleshow/101603018.cms"
    },
    {
      "id": "1160",
      "title": "CONCACAF Gold Cup 2023: Full schedule, scores, where to watch, live streaming options and more",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-40236,resizemode-4,msid-101602975/concacaf-gold-cup-2023-full-schedule-scores-where-to-watch-live-streaming-options-and-more.jpg",
      "description": "The 2023 CONCACAF Gold Cup will be held in various cities across North America, including Toronto, Arlington, Charlotte, Chicago, Cincinnati, Glendale, Harrison, Inglewood, Paradise, St. Louis, San Diego, Santa Clara, and Houston (twice).",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/concacaf-gold-cup-2023-full-schedule-scores-where-to-watch-live-streaming-options-and-more/articleshow/101602975.cms"
    },
    {
      "id": "1110",
      "title": "US weather forecast: Heavy rain alert for Washington, D.C, New York, and other parts; Flash flood warning issued",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-96076,resizemode-4,msid-101602395/us-weather-forecast-heavy-rain-alert-for-washington-d-c-new-york-and-other-parts-flash-flood-warning-issued.jpg",
      "description": "US weather forecast today predicted sudden heavy rainfall for Washington, D.C, New York, and Philadelphia and a flash flood warning for northeastern parts of the country.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/us-weather-forecast-heavy-rain-alert-for-washington-d-c-new-york-and-other-parts-flash-flood-warning-issued/articleshow/101602395.cms"
    },
    {
      "id": "1109",
      "title": "Charles Manson follower Leslie Van Houten to be freed after 53 years? What we know so far",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-27346,resizemode-4,msid-101602883/charles-manson-follower-leslie-van-houten-to-be-freed-after-53-years-what-we-know-so-far.jpg",
      "description": "Charles Manson follower Leslie Van Houten is likely to be out on parole after California governor Gavin Newsom decided not to contest a US court ruling in favour of the infamous killer.",
      "published_date": "2023-07-09",
      "url": "https://economictimes.indiatimes.com/news/international/us/charles-manson-follower-leslie-van-houten-to-be-freed-after-53-years-what-we-know-so-far/articleshow/101602883.cms"
    },
    {
      "id": "1062",
      "title": "Prince Harry and Meghan Markle in financial trouble post Spotify and Netflix snub? Here’s the truth",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-18596,resizemode-4,msid-101602018/prince-harry-and-meghan-markle-in-financial-trouble-post-spotify-and-netflix-snub-heres-the-truth.jpg",
      "description": "Meghan Markle and Prince Harry are not doing well financially after their company’s fallout with Spotify and Netflix, say reports. Here’s what we know.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/prince-harry-and-meghan-markle-in-financial-trouble-post-spotify-and-netflix-snub-heres-the-truth/articleshow/101602018.cms"
    },
    {
      "id": "1061",
      "title": "Scientists say 2023 could be hottest year on record",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-70106,resizemode-4,msid-101602363/scientists-say-2023-could-be-hottest-year-on-record.jpg",
      "description": "With the world’s average temperature reaching 17.23 degrees Celsius this month and it is going further up, 2023 may become the hottest year.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/scientists-say-2023-could-be-hottest-year-on-record/articleshow/101602363.cms"
    },
    {
      "id": "1060",
      "title": "TikTok videos: How to recover deleted videos? Here’s everything you should know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-9172,resizemode-4,msid-101602404/tiktok-videos-how-to-recover-deleted-videos-heres-everything-you-should-know.jpg",
      "description": "TikTok provides users with the opportunity to create and share short videos, enhanced with a wide range of special effects and filters. While TikTok videos have a maximum duration of 10 minutes, the most widely favoured videos tend to be concise, often spanning less than 15 seconds.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/tiktok-videos-how-to-recover-deleted-videos-heres-everything-you-should-know/articleshow/101602404.cms"
    },
    {
      "id": "1059",
      "title": "India now biggest source market for Sri Lanka tourism",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-150892,resizemode-4,msid-101602421/india-now-biggest-source-market-for-sri-lanka-tourism.jpg",
      "description": "\"India has been the biggest source market. Even going back in time, every time we have had a crisis, when we have come to a real crunch, it is India that has come to our rescue. At the moment the top markets are India and Russia. UK was a very big market. Hopefully, it should come back,\"  Chalaka Gajabahu, chairman, Sri Lanka Tourism Promotion Bureau (SLTPB) said.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/business/india-now-biggest-source-market-for-sri-lanka-tourism/articleshow/101602421.cms"
    },
    {
      "id": "1011",
      "title": "EPL fixtures, live matches, teams, winter break - All you may want to know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-35356,resizemode-4,msid-101601740/epl-fixtures-live-matches-teams-winter-break-all-you-may-want-to-know.jpg",
      "description": "EPL fixtures are here and fans will be able to watch 380 soccer matches.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/epl-fixtures-live-matches-teams-winter-break-all-you-may-want-to-know/articleshow/101601740.cms"
    },
    {
      "id": "968",
      "title": "Pakistan allows foreign investors to remit entire profit abroad",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-11384,resizemode-4,msid-101601441/pakistan-allows-foreign-investors-to-remit-entire-profit-abroad.jpg",
      "description": "The policy was readied after consultations with the World Bank, International Finance Corporation, and provincial and federal institutions, people, familiar with the matter, said.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/pakistan-allows-foreign-investors-to-remit-entire-profit-abroad/articleshow/101601441.cms"
    },
    {
      "id": "967",
      "title": "Taylor Swift reunites with Tayler Lautner for ‘I Can See You’ music video, which also casts Joey King and Presley Cash",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-24522,resizemode-4,msid-101601333/taylor-swift-reunites-with-tayler-lautner-for-i-can-see-you-music-video-which-also-casts-joey-king-and-presley-cash.jpg",
      "description": "Taylor Swift chose to reunite with her ex-boyfriend Taylor Lautner for her latest music video, \"I Can See You.\"",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/taylor-swift-reunites-with-tayler-lautner-for-i-can-see-you-music-video-which-also-casts-joey-king-and-presley-cash/articleshow/101601333.cms"
    },
    {
      "id": "966",
      "title": "The Vampire Diaries actor Paul Wesley doesn’t miss playing Stefan, wants to be known for other roles",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-6682,resizemode-4,msid-101601578/the-vampire-diaries-actor-paul-wesley-doesnt-miss-playing-stefan-wants-to-be-known-for-other-roles.jpg",
      "description": "Actor Paul Wesley, who starred in The Vampire Diaries from 2009 to 2017, is not nostalgic about playing the lead in the series.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/the-vampire-diaries-actor-paul-wesley-doesnt-miss-playing-stefan-wants-to-be-known-for-other-roles/articleshow/101601578.cms"
    },
    {
      "id": "965",
      "title": "What cluster bombs mean for Ukraine war effort: AP reports",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-60324,resizemode-4,msid-101601646/what-cluster-bombs-mean-for-ukraine-war-effort-ap-reports.jpg",
      "description": "",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/what-cluster-bombs-mean-for-ukraine-war-effort-ap-reports/videoshow/101601646.cms"
    },
    {
      "id": "964",
      "title": "Stranger Things season 5 release date on Netflix: All we know so far",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-146260,resizemode-4,msid-101601651/stranger-things-season-5-release-date-on-netflix-all-we-know-so-far.jpg",
      "description": "\"Stranger Things\" season 5 release date on Netflix is yet to be announced officially. There is a possibility that the season 5 of \"Stranger Things\" will premier on Summer of 2025.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/stranger-things-season-5-release-date-on-netflix-all-we-know-so-far/articleshow/101601651.cms"
    },
    {
      "id": "963",
      "title": "British Grand Prix Qualifying: Lando Norris fails to secure pole position as Max Verstappen takes top spot",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-87176,resizemode-4,msid-101601680/british-grand-prix-qualifying-lando-norris-fails-to-secure-pole-position-as-max-verstappen-takes-top-spot.jpg",
      "description": "In a remarkable achievement, Max Verstappen secures his fifth consecutive pole position, marking the first time he has achieved such a feat in his career. Notably, Lando Norris and Oscar Piastri of McLaren claim second and third place, respectively, in the qualifying session.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/british-grand-prix-qualifying-lando-norris-fails-to-secure-pole-position-as-max-verstappen-takes-top-spot/articleshow/101601680.cms"
    },
    {
      "id": "923",
      "title": "Northern Lights in US: Check dates, List of states from where it can be visible",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-20336,resizemode-4,msid-101600766/northern-lights-in-us-check-dates-list-of-states-from-where-it-can-be-visible.jpg",
      "description": "Northern Lights will be visible from a number states across the US. We have all details pertaining to the viewing of Northern Lights.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/northern-lights-in-us-check-dates-list-of-states-from-where-it-can-be-visible/articleshow/101600766.cms"
    },
    {
      "id": "922",
      "title": "Joro Spiders: All about the spider species that is spreading across U.S.",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-49126,resizemode-4,msid-101601240/joro-spiders-all-about-the-spider-species-that-is-spreading-across-u-s-.jpg",
      "description": "Joro spiders, originating from East Asia, are invasive in the US. They weave golden webs, pose no significant harm to humans, and help control insect populations. Measures like removing webs and egg sacs can reduce their numbers, but complete eradication is challenging.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/joro-spiders-all-about-the-spider-species-that-is-spreading-across-u-s-/articleshow/101601240.cms"
    },
    {
      "id": "921",
      "title": "Speak Now 2023 album: Is Taylor Swift’s song When Emma Falls in Love about Emma Stone?",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-231840,resizemode-4,msid-101601300/speak-now-2023-album-is-taylor-swifts-song-when-emma-falls-in-love-about-emma-stone.jpg",
      "description": "Taylor Swift’s fandom suggests that her song When Emma Falls in Love is about her best friend and actor Emma Stone’s love life. Here’s why it could be true.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/speak-now-2023-album-is-taylor-swifts-song-when-emma-falls-in-love-about-emma-stone/articleshow/101601300.cms"
    },
    {
      "id": "920",
      "title": "Thousands rally in Bangladesh to condemn Koran burning in Sweden",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-30414,resizemode-4,msid-101601356/thousands-rally-in-bangladesh-to-condemn-koran-burning-in-sweden.jpg",
      "description": "",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/thousands-rally-in-bangladesh-to-condemn-koran-burning-in-sweden/videoshow/101601356.cms"
    },
    {
      "id": "883",
      "title": "PM Mark Rutte quits over migration policy, Netherlands heads towards snap poll",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-3864,resizemode-4,msid-101600024/pm-mark-rutte-quits-over-migration-policy-netherlands-heads-towards-snap-poll.jpg",
      "description": "Dutch Prime Minister Mark Rutte quits after talks with the coalition partner over migration policy failed. King Willem Alexander may ask him to continue as a caretaker.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/pm-mark-rutte-quits-over-migration-policy-netherlands-heads-towards-snap-poll/articleshow/101600024.cms"
    },
    {
      "id": "882",
      "title": "F1 British Grand Prix: All eyes set on Max Verstappen, Lewis Hamilton",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-152068,resizemode-4,msid-101600110/f1-british-grand-prix-all-eyes-set-on-max-verstappen-lewis-hamilton.jpg",
      "description": "All eyes are set on Max Verstappen and Lewis Hamilton as the British Grand Prix takes place on July 9, 2023.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/f1-british-grand-prix-all-eyes-set-on-max-verstappen-lewis-hamilton/articleshow/101600110.cms"
    },
    {
      "id": "881",
      "title": "FIFA Women’s World Cup 2023: Switzerland have enough fire-power",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-84138,resizemode-4,msid-101600139/fifa-womens-world-cup-2023-switzerland-have-enough-fire-power.jpg",
      "description": "Earlier, Switzerland have played in the FIFA World Cup only once in 2015, when Canada knocked them out of the Round of 16.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/fifa-womens-world-cup-2023-switzerland-have-enough-fire-power/articleshow/101600139.cms"
    },
    {
      "id": "880",
      "title": "England vs Spain Live Streaming: Where and how to watch live telecast of European Under-21 Championship final",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-39546,resizemode-4,msid-101600330/england-vs-spain-live-streaming-where-and-how-to-watch-live-telecast-of-european-under-21-championship-final.jpg",
      "description": "England vs Spain European Under-21 Championship final will be live streamed today. We have all the details.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/uk/england-vs-spain-live-streaming-where-and-how-to-watch-live-telecast-of-european-under-21-championship-final/articleshow/101600330.cms"
    },
    {
      "id": "879",
      "title": "AI ChatGPT-powered smart toys may soon be unveiled; Here’s everything parents need to know ahead of holiday season",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-22024,resizemode-4,msid-101600383/ai-chatgpt-powered-smart-toys-may-soon-be-unveiled-heres-everything-parents-need-to-know-ahead-of-holiday-season.jpg",
      "description": "Owing to their innovative features, AI-driven smart toys are set to become the most sought-after items of the holiday season. Several noteworthy examples of such toys slated for release this Christmas include:",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/ai-chatgpt-powered-smart-toys-may-soon-be-unveiled-heres-everything-parents-need-to-know-ahead-of-holiday-season/articleshow/101600383.cms"
    },
    {
      "id": "878",
      "title": "Wimbledon school crash: Local community mourns death of 8-yr-old Selena Lau",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-17066,resizemode-4,msid-101600382/wimbledon-school-crash-local-community-mourns-death-of-8-yr-old-selena-lau.jpg",
      "description": "An eight-year-old girl was killed in a tragic car crash in Wimbledon. The incident led to the death of Selena and 15 others were injured. ",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/wimbledon-school-crash-local-community-mourns-death-of-8-yr-old-selena-lau/articleshow/101600382.cms"
    },
    {
      "id": "877",
      "title": "Deadpool 3: Is Jennifer Garner Returning as Elektra in Ryan Reynolds film? Here’s what we know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-30948,resizemode-4,msid-101600621/deadpool-3-is-jennifer-garner-returning-as-elektra-in-ryan-reynolds-film-heres-what-we-know.jpg",
      "description": "Actor Jennifer Garner first played the character of Elektra with ex-husband Ben Affleck in the film Daredevil 20 years ago. She later had her spin-off film, Elektra, in 2005.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/deadpool-3-is-jennifer-garner-returning-as-elektra-in-ryan-reynolds-film-heres-what-we-know/articleshow/101600621.cms"
    },
    {
      "id": "876",
      "title": "NBA: Victor Wembanyama debuts in Las Vegas Summer League",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-26806,resizemode-4,msid-101600694/nba-victor-wembanyama-debuts-in-las-vegas-summer-league.jpg",
      "description": "Thousands of NBA enthusiasts waited for hours as Victor Wembanyama made his debut in the Las Vegas Summer League. ",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/nba-victor-wembanyama-debuts-in-las-vegas-summer-league/articleshow/101600694.cms"
    },
    {
      "id": "836",
      "title": "Ahead of Amazon Prime Day sale 2023, here are top discounts on video game books",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-1265376,resizemode-4,msid-101599679/ahead-of-amazon-prime-day-sale-2023-here-are-top-discounts-on-video-game-books.jpg",
      "description": "Ahead of Amazon Prime Day 2023, video game-themed books lover have a chance to avail lucrative deals.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/ahead-of-amazon-prime-day-sale-2023-here-are-top-discounts-on-video-game-books/articleshow/101599679.cms"
    },
    {
      "id": "795",
      "title": "Quordle 530, July 8: What are the clues and answers for this Saturday’s word puzzle?",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-19050,resizemode-4,msid-101598115/quordle-530-july-8-what-are-the-clues-and-answers-for-this-saturdays-word-puzzle.jpg",
      "description": "Here are the hints and the answers to today’s word puzzle, the Quordle 530 dated July 8, 2023. These are for the general puzzle and not sequence.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/quordle-530-july-8-what-are-the-clues-and-answers-for-this-saturdays-word-puzzle/articleshow/101598115.cms"
    },
    {
      "id": "794",
      "title": "Lana Del Rey announces support acts for BST Hyde Park performance — Details",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-18880,resizemode-4,msid-101598386/lana-del-rey-announces-support-acts-for-bst-hyde-park-performance-details.jpg",
      "description": "The acclaimed and enigmatic singer-songwriter, Lana Del Rey, is set to headline a major open-air concert in London at American Express presents BST Hyde Park on Sunday, July 9.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/lana-del-rey-announces-support-acts-for-bst-hyde-park-performance-details/articleshow/101598386.cms"
    },
    {
      "id": "732",
      "title": "Russian fighter jets harass American drones over Syria: US military",
      "image": "",
      "description": "The U.S. military said in a statement that Friday’s encounter lasted for about two hours during which three MQ-9 drones were “once again harassed” by Russian fighter aircraft while flying over Syria. BEIRUT: Russian fighter jets have “harassed” American drones over Syria for the third day in a row this week, the U.S. military said.\n\nTension between Russian and U.S. troops is not uncommon in Syria as both countries conduct patrols on the ground as well as overflights. Syria’s 12-year conflict has left half a million people dead and over 1 million wounded.\n\nThe U.S. military said in a statement that Friday’s encounter lasted for about two hours during which three MQ-9 drones were “once again harassed” by Russian fighter aircraft while flying over Syria.\n\n“Russian aircraft flew 18 unprofessional close passes that caused the MQ-9s to react to avoid unsafe situations,” Lt. Gen. Alex Grynkewich, head of U.S. Air Forces Central Command, said in a statement.\n\nRear Adm. Oleg Gurinov, head of the Russian Reconciliation Center for Syria, said earlier this week that the Russian and Syrian militaries have started a six-day joint training that ends Monday.\n\nGurinov added in comments carried by Syrian state media earlier this week that Moscow is concerned about the flights of drones by the U.S.-led coalition over northern Syria, calling them “systematic violations of protocols” designed to avoid clashes between the two militaries.\n\nThe first friction occurred on Wednesday morning when Russian military aircraft “engaged in unsafe and unprofessional behaviour” as three U.S. MQ-9 drones were conducting a mission against the Islamic State group, the U.S. military said. On Thursday, the U.S. military said Russian fighter aircraft flew “incredibly unsafe and unprofessionally” against both French and U.S. aircraft over Syria.\n\nThe U.S. and France are part of an international coalition fighting IS that once controlled the largest parts of Syria and Iraq where the extremists declared a caliphate. Despite IS defeat in Iraq in 2017 and in Syria less than two years later, the extremists still carry out deadly attacks in both countries.\n\nOn Friday, a drone attack by the U.S.-led coalition killed a man in northern Syria who was riding a motorcycle. The Syrian Observatory for Human Rights, an opposition war monitor, said the man was an IS militant.\n\nRussia joined Syria’s conflict in September 2015 and has since helped tip the balance of power in favour of Syrian President Bashar Assad’s forces. Russian warplanes still carry out attacks against the last major rebel stronghold in Syria’s northwest.\n\nOn any given day there are at least 900 U.S. forces in Syria, along with an undisclosed number of contractors, who partner with the Kurdish-led Syrian Democratic Forces.\n\n“We continue to encourage Russia to return to the established norms of a professional Air Force so we can all return our focus to ensuring the enduring defeat of ISIS,” Grynkewich said, using a term to refer to IS.\n\nGurinov, the Russian officer, warned that the increase of “uncoordinated flights” for the coalition’s drones leads to escalation and “Russia is not responsible for the safety of these flights.” ",
      "published_date": "2023-07-08",
      "url": "http://www.newindianexpress.com/world/2023/jul/08/russian-fighter-jets-harass-american-drones-over-syriaus-military-2592741.html"
    },
    {
      "id": "707",
      "title": "The Summer I Turned Pretty Season 2: How to watch on Amazon Prime Video; episode schedule",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-19896,resizemode-4,msid-101595710/the-summer-i-turned-pretty-season-2-how-to-watch-on-amazon-prime-video-episode-schedule.jpg",
      "description": "Season two of The Summer I Turned Pretty will soon stream on Prime Video. Here are the premiere details and the episodic schedule.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/the-summer-i-turned-pretty-season-2-how-to-watch-on-amazon-prime-video-episode-schedule/articleshow/101595710.cms"
    },
    {
      "id": "535",
      "title": "NBA Summer League: French star Victor Wembanyama delivers a lackluster performance for San Antonio Spurs",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-85900,resizemode-4,msid-101590307/nba-summer-league-french-star-victor-wembanyama-delivers-a-lackluster-performance-for-san-antonio-spurs.jpg",
      "description": "Victor Wembanyama, the highly anticipated top draft pick for the San Antonio Spurs, had a challenging debut in the NBA Summer League. Despite struggling with shooting, he remains determined to learn and improve while showcasing his defensive skills. Patience and growth are emphasized by the Spurs organization.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/nba-summer-league-french-star-victor-wembanyama-delivers-a-lackluster-performance-for-san-antonio-spurs/articleshow/101590307.cms"
    },
    {
      "id": "408",
      "title": "Janet Yellen urges China to support existing institutions to fight climate change",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-62072,resizemode-4,msid-101586546/janet-yellen-urges-china-to-support-existing-institutions-to-fight-climate-change.jpg",
      "description": "China is the largest market after Europe for climate funds, surpassing the U.S. as funds in China have more than doubled since 2021 to $46.7 billion, according to research firm Morningstar. But the World Bank said last year China needs up to $17 trillion in additional investment for green infrastructure and technology in the power and transport sectors to reach its target of net-zero carbon emissions by 2060, underscoring the need for private investment.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/janet-yellen-urges-china-to-support-existing-institutions-to-fight-climate-change/articleshow/101586546.cms"
    },
    {
      "id": "366",
      "title": "What are cluster munitions that the U.S. is sending to Ukraine despite criticism?",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-112480,resizemode-4,msid-101585946/what-are-cluster-munitions-that-the-u-s-is-sending-to-ukraine-despite-criticism.jpg",
      "description": "The United States has decided to supply cluster munitions to Ukraine for the first time, drawing criticism from human rights groups. Cluster munitions are widely condemned due to their indiscriminate nature, risk to civilians, and long-lasting threat of unexploded bomblets. The decision is part of an $800 million military aid package.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/what-are-cluster-munitions-that-the-u-s-is-sending-to-ukraine-despite-criticism/articleshow/101585946.cms"
    },
    {
      "id": "365",
      "title": "US to send cluster munitions to Ukraine; says will not leave the country defenseless",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-42954,resizemode-4,msid-101586232/us-to-send-cluster-munitions-to-ukraine-says-will-not-leave-the-country-defenseless.jpg",
      "description": "",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/us-to-send-cluster-munitions-to-ukraine-says-will-not-leave-the-country-defenseless/videoshow/101586232.cms"
    },
    {
      "id": "148",
      "title": "Mississippi State Football Legend Johnie Cooks passes away at age of 64",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-121920,resizemode-4,msid-101582363/mississippi-state-football-legend-johnie-cooks-passes-away-at-age-of-64.jpg",
      "description": "Mississippi State mourns the loss of football great Johnie Cooks, a revered figure in Bulldog and SEC history. The exceptional career of Cooks and its impact on the sport will be cherished forever.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/mississippi-state-football-legend-johnie-cooks-passes-away-at-age-of-64/articleshow/101582363.cms"
    },
    {
      "id": "147",
      "title": "Ashley Benson gets engaged to oil heir Brandon Davis. See details",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-68410,resizemode-4,msid-101582399/ashley-benson-gets-engaged-to-oil-heir-brandon-davis-see-details.jpg",
      "description": "Actor Ashley Benson announces her engagement to oil heir Brandon Davis on Instagram, sharing her excitement and love for her new fiancé.",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/ashley-benson-gets-engaged-to-oil-heir-brandon-davis-see-details/articleshow/101582399.cms"
    },
    {
      "id": "146",
      "title": "Disney+: See exciting new additions on the platform this weekend",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-17868,resizemode-4,msid-101582413/disney-see-exciting-new-additions-on-the-platform-this-weekend.jpg",
      "description": "These exciting additions provide a wide range of options for Disney+ users, from thrilling shark documentaries to animated adventures and beloved Disney classics. Enjoy your weekend streaming!",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/disney-see-exciting-new-additions-on-the-platform-this-weekend/articleshow/101582413.cms"
    },
    {
      "id": "43",
      "title": "Ukraine asks to join CPTPP trade pact",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-7020,resizemode-4,msid-101563222/ukraine-asks-to-join-cptpp-trade-pact.jpg",
      "description": "New Zealand, which performs the legal depositary functions for the partnership, had received a formal accession request from Ukraine on May 5, a New Zealand foreign ministry spokesperson said. The next steps in the application process would be determined by all members of the CPTPP, who are due to meet in the New Zealand city Auckland on July 16, the spokesperson said.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/business/ukraine-asks-to-join-cptpp-trade-pact/articleshow/101563222.cms"
    },
    {
      "id": "42",
      "title": "Australia inquiry says ex-PM Morrison misled cabinet on debt recovery scheme",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-37028,resizemode-4,msid-101567596/australia-inquiry-says-ex-pm-morrison-misled-cabinet-on-debt-recovery-scheme.jpg",
      "description": "Morrison, prime minister from August 2018 to May 2022 and still a member of parliament, rejected each finding adverse to him and critical of his involvement in \"authorising the scheme\". \"They are wrong, unsubstantiated and contradicted by clear documentary evidence presented to the Commission,\" he said in a statement.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/australia-inquiry-says-ex-pm-morrison-misled-cabinet-on-debt-recovery-scheme/articleshow/101567596.cms"
    },
    {
      "id": "41",
      "title": "Quordle Today: Clues, solutions to crack July 7 puzzle",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-4300,resizemode-4,msid-101572719/quordle-today-clues-solutions-to-crack-july-7-puzzle.jpg",
      "description": "Quordle is back with yet another tricky puzzle. Here are some clues and the right solutions to help you level up your game. Keep scrolling to read what you need.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/quordle-today-clues-solutions-to-crack-july-7-puzzle/articleshow/101572719.cms"
    },
    {
      "id": "40",
      "title": "Bruce Springsteen in London: BST Hyde Park July 8 performance details and highlights of July 6",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-120050,resizemode-4,msid-101574824/bruce-springsteen-in-london-bst-hyde-park-july-8-performance-details-and-highlights-of-july-6.jpg",
      "description": "American singer Bruce Springsteen is back in London and will be playing at the Hyde Park Festival on July 8, 2023. The singer performed for three hours on July 6 to forget his earlier experience of being ‘cut-off’ in the city.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/uk/bruce-springsteen-in-london-bst-hyde-park-july-8-performance-details-and-highlights-of-july-6/articleshow/101574824.cms"
    },
    {
      "id": "39",
      "title": "Wimbledon 2023: TV Schedule for today, Order of Play and all details here",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-84320,resizemode-4,msid-101575530/wimbledon-2023-tv-schedule-for-today-order-of-play-and-all-details-here.jpg",
      "description": "Wimbledon 2023 will be seeing a massive day on Day 5 after the continuation of second-round matches along with third-round duels.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/wimbledon-2023-tv-schedule-for-today-order-of-play-and-all-details-here/articleshow/101575530.cms"
    },
    {
      "id": "38",
      "title": "Where and when will Guardians of the Galaxy Vol. 3 be streaming on OTT?",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-125904,resizemode-4,msid-101575833/where-and-when-will-guardians-of-the-galaxy-vol-3-be-streaming-on-ott.jpg",
      "description": "Guardians of the Galaxy Vol. 3 will soon be streaming on Disney+. It will also be available as VOD on other OTT platforms. Here are details of the Marvel film’s OTT release.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/where-and-when-will-guardians-of-the-galaxy-vol-3-be-streaming-on-ott/articleshow/101575833.cms"
    },
    {
      "id": "37",
      "title": "Andy Murray to resume second-round Match at Wimbledon against Stefanos Tsitsipas",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-18948,resizemode-4,msid-101577263/andy-murray-to-resume-second-round-match-at-wimbledon-against-stefanos-tsitsipas.jpg",
      "description": "Andy Murray continues his Wimbledon match against Stefanos Tsitsipas today, following an impressive comeback on Centre Court. ",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/andy-murray-to-resume-second-round-match-at-wimbledon-against-stefanos-tsitsipas/articleshow/101577263.cms"
    },
    {
      "id": "36",
      "title": "Beetlejuice 2: Jenna Ortega, Winona Ryder spotted filming Tim Burton sequel; Monica Bellucci joins cast",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-63410,resizemode-4,msid-101577555/beetlejuice-2-jenna-ortega-winona-ryder-spotted-filming-tim-burton-sequel-monica-bellucci-joins-cast.jpg",
      "description": " Wednesday actor Jenna Ortega stars as Winona Ryder’s daughter in the sequel to Tim Burton’s 1988 hit film Beetlejuice. Here are the details of the film.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/beetlejuice-2-jenna-ortega-winona-ryder-spotted-filming-tim-burton-sequel-monica-bellucci-joins-cast/articleshow/101577555.cms"
    },
    {
      "id": "35",
      "title": "Brutal heat wave sweeps across U.S; Phoenix, Arizona could break high-temperature record set in 1970s",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-71896,resizemode-4,msid-101577296/brutal-heat-wave-sweeps-across-u-s-phoenix-arizona-could-break-high-temperature-record-set-in-1970s.jpg",
      "description": "The United States is grappling with severe weather conditions, including thunderstorms, wildfires, and heatwaves, while global temperatures continue to break records. Phoenix, Arizona, faces a potential high-temperature record, and over 90 million Americans endure scorching temperatures. Scientists warn of escalating heatwave severity due to human-induced climate change and the transition to El Niño. ",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/brutal-heat-wave-sweeps-across-u-s-phoenix-arizona-could-break-high-temperature-record-set-in-1970s/articleshow/101577296.cms"
    },
    {
      "id": "34",
      "title": "US economy adds 209,000 jobs as hiring slows",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-293090,resizemode-4,msid-101577934/us-economy-adds-209000-jobs-as-hiring-slows.jpg",
      "description": "The slower pace of hiring will be welcome news for the US Federal Reserve, which recently paused its aggressive campaign of rate hikes to give policymakers more time to assess the health of the US economy.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/us-economy-adds-209000-jobs-as-hiring-slows/articleshow/101577934.cms"
    },
    {
      "id": "33",
      "title": "Empire Cinemas chain changes administration; 150 jobs lost and 6 cinemas shut down; Full list here",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-70352,resizemode-4,msid-101578323/empire-cinemas-chain-changes-administration-150-jobs-lost-and-6-cinemas-shut-down-full-list-here.jpg",
      "description": "A restructuring specialist from BDO, appointed as an administrator for Empire Cinemas, stated that the leisure industry has been heavily impacted by well-known difficulties arising from the effects of COVID-19, increasing inflation, and the ongoing cost of living crisis. These factors have had a significant impact on the business operations of the company.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/uk/empire-cinemas-chain-changes-administration-150-jobs-lost-and-6-cinemas-shut-down-full-list-here/articleshow/101578323.cms"
    },
    {
      "id": "32",
      "title": "Glamorous on Netflix: Will the series be renewed for Season 2 or canceled? Here’s what we know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-48028,resizemode-4,msid-101578943/glamorous-on-netflix-will-the-series-be-renewed-for-season-2-or-canceled-heres-what-we-know.jpg",
      "description": " Here’s all the information on Netflix show Glamorous, how the first season fared, and whether there is a season 2.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/glamorous-on-netflix-will-the-series-be-renewed-for-season-2-or-canceled-heres-what-we-know/articleshow/101578943.cms"
    },
    {
      "id": "31",
      "title": "Will Ben Affleck reprise his role as Daredevil in Deadpool 3? Here’s everything we know about the rumour",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-81692,resizemode-4,msid-101579028/will-ben-affleck-reprise-his-role-as-daredevil-in-deadpool-3-heres-everything-we-know-about-the-rumour.jpg",
      "description": "Marvel Cinematic Universe (MCU) is renowned for its unexpected twists, and it appears that Deadpool 3 will uphold this tradition. Recent rumours indicate that Ben Affleck will return as Daredevil in the upcoming movie, intensifying the anticipation surrounding the highly-awaited sequel.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/will-ben-affleck-reprise-his-role-as-daredevil-in-deadpool-3-heres-everything-we-know-about-the-rumour/articleshow/101579028.cms"
    },
    {
      "id": "30",
      "title": "What to watch this weekend: Wham!, Superman, Bear Grylls, and other options",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-63920,resizemode-4,msid-101580336/what-to-watch-this-weekend-wham-superman-bear-grylls-and-other-options.jpg",
      "description": "The weekend binge watch schedule could include Wham!, Superman, Bear Grylls, or The Lincoln Lawyer. Here are some of our suggestions.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/what-to-watch-this-weekend-wham-superman-bear-grylls-and-other-options/articleshow/101580336.cms"
    },
    {
      "id": "29",
      "title": "Prime Day 2023: See how to join Amazon Prime",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-1265376,resizemode-4,msid-101580498/prime-day-2023-see-how-to-join-amazon-prime.jpg",
      "description": "Amazon Prime Day 2023 will be held on July 11 and 12. Let us get to know the process of joining Amazon Prime.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/prime-day-2023-see-how-to-join-amazon-prime/articleshow/101580498.cms"
    },
    {
      "id": "28",
      "title": "Jujutsu Kaisen Season 2 Episode 2: See release date and other details",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-52062,resizemode-4,msid-101580650/jujutsu-kaisen-season-2-episode-2-see-release-date-and-other-details.jpg",
      "description": "Jujutsu Kaisen season 2 revolves around the enthralling Past Arc, which spans the first five episodes.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/jujutsu-kaisen-season-2-episode-2-see-release-date-and-other-details/articleshow/101580650.cms"
    },
    {
      "id": "27",
      "title": "Heartbreak High Season 2: See release date on Netflix and what we know so far",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-58112,resizemode-4,msid-101580829/heartbreak-high-season-2-see-release-date-on-netflix-and-what-we-know-so-far.jpg",
      "description": "Netflix has confirmed that Heartbreak High season 2 will be released in 2024. Get ready for another dose of gripping storytelling, diverse representation and compelling characters in Heartbreak High season 2.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/heartbreak-high-season-2-see-release-date-on-netflix-and-what-we-know-so-far/articleshow/101580829.cms"
    },
    {
      "id": "26",
      "title": "Has Netflix canceled Snowflake Mountain after season one? Here’s what we know",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-148294,resizemode-4,msid-101580885/has-netflix-canceled-snowflake-mountain-after-season-one-heres-what-we-know.jpg",
      "description": "Snowflake Mountain, a reality show on Netflix, has not been renewed by the OTT platform for a second season. Here’s why.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/has-netflix-canceled-snowflake-mountain-after-season-one-heres-what-we-know/articleshow/101580885.cms"
    },
    {
      "id": "25",
      "title": "Who is Katie Notopoulos? Know about editor-in-chief of Threads now ‘fired’ over a controversial post",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-41742,resizemode-4,msid-101580928/who-is-katie-notopoulos-know-about-editor-in-chief-of-threads-now-fired-over-a-controversial-post.jpg",
      "description": "Katie Notopoulos, who claimed to hold the position of Editor in Chief at Threads, a social media platform developed by Meta as a competitor to Twitter, experienced significant online backlash following her controversial post expressing support for Nazi ideologies.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/who-is-katie-notopoulos-know-about-editor-in-chief-of-threads-now-fired-over-a-controversial-post/articleshow/101580928.cms"
    },
    {
      "id": "24",
      "title": "Dozens rescued after being stranded overnight in world’s highest Cable Car systems due to technical glitch",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-57290,resizemode-4,msid-101581002/dozens-rescued-after-being-stranded-overnight-in-worlds-highest-cable-car-systems-due-to-technical-glitch.jpg",
      "description": "Authorities dedicated nearly 10 hours to a meticulous rescue operation to save 75 individuals and solve the technical glitch",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/dozens-rescued-after-being-stranded-overnight-in-worlds-highest-cable-car-systems-due-to-technical-glitch/articleshow/101581002.cms"
    },
    {
      "id": "23",
      "title": "Watch: Russian jets harass US drone aircraft over Syria",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-10802,resizemode-4,msid-101581146/watch-russian-jets-harass-us-drone-aircraft-over-syria.jpg",
      "description": "",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/world-news/watch-russian-jets-harass-us-drone-aircraft-over-syria/videoshow/101581146.cms"
    },
    {
      "id": "22",
      "title": "Northern Lights in Canada; Here’s the list of all the provinces where you may get to watch the Auroras next week",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-61012,resizemode-4,msid-101581201/northern-lights-in-canada-heres-the-list-of-all-the-provinces-where-you-may-get-to-watch-the-auroras-next-week.jpg",
      "description": "If catching a glimpse of the magnificent northern lights, also known as the aurora borealis, is a desire on your list, there is a chance you might be in for a treat. On July 13, the awe-inspiring display could potentially grace the skies of over 17 US states.",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/northern-lights-in-canada-heres-the-list-of-all-the-provinces-where-you-may-get-to-watch-the-auroras-next-week/articleshow/101581201.cms"
    },
    {
      "id": "21",
      "title": "US hiring slowed in June, still added 209,000 jobs",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-19628,resizemode-4,msid-101581505/us-hiring-slowed-in-june-still-added-209000-jobs.jpg",
      "description": "",
      "published_date": "2023-07-07",
      "url": "https://economictimes.indiatimes.com/news/international/us/us-hiring-slowed-in-june-still-added-209000-jobs/videoshow/101581505.cms"
    },
    {
      "id": "20",
      "title": "National Girlfriend Day: See the origin and significance",
      "image": "https://img.etimg.com/thumb/width-1200,imgsize-32866,resizemode-4,msid-101581849/national-girlfriend-day-see-the-origin-and-significance.jpg",
      "description": "Celebrate the beauty of love on National Girlfriend Day, August 1. This heartfelt holiday emerged organically through social media, encouraging partners and friends to honor the special bonds shared with their girlfriends. ",
      "published_date": "2023-07-08",
      "url": "https://economictimes.indiatimes.com/news/international/us/national-girlfriend-day-see-the-origin-and-significance/articleshow/101581849.cms"
    },
    {
      "id": "19",
      "title": "Kansas shooting hospitalizes 9 victims including 7 people shot and 2 trampled, police say",
      "image": "",
      "description": "Shots were fired just before 1 a.m. in a nightclub on North Washington Street, Wichita Police Lt. Aaron Moses said during a press conference at the scene. WICHITA: A shooting in Kansas left seven people with gunshot wounds and an additional two victims hospitalized after being trampled as people rushed out of a nightclub early Sunday morning, police said.\n\nShots were fired just before 1 a.m. in a nightclub on North Washington Street, Wichita Police Lt. Aaron Moses said during a press conference at the scene.\n\n\"We have seven people who have been shot. We have two people who have been trampled during the mass exodus out the club,\" Moses said, noting the investigation was still in the preliminary stage.\n\nThere were no fatalities, but there was one critical injury. All the victims were being treated at an area hospital, Moses said.\n\nOne person was detained by police for questioning, Moses said.\n  ",
      "published_date": "2023-07-02",
      "url": "http://www.newindianexpress.com/world/2023/jul/02/kansas-shooting-hospitalizes-9-victims-including-7-people-shot-and-2-trampled-police-say-2590721.html"
    },
    {
      "id": "18",
      "title": "Putin will speak with leaders of China and India in his first summit since Wagner insurrection",
      "image": "",
      "description": "This year’s event is hosted by India, which became a member in 2017. It’s the latest avenue for Prime Minister Narendra Modi to showcase the country’s growing global clout. NEW DELHI: President Vladimir Putin will participate this week in his first multilateral summit since an armed rebellion rattled Russia, as part of a rare international grouping in which his country still enjoys support.\n\nLeaders will convene virtually on Tuesday for a summit of the Shanghai Cooperation Organization, a security grouping founded by Russia and China to counter Western alliances from East Asia to the Indian Ocean.\n\nThis year’s event is hosted by India, which became a member in 2017. It’s the latest avenue for Prime Minister Narendra Modi to showcase the country’s growing global clout.\n\nThe group so far has focused on deepening security and economic cooperation, fighting terrorism and drug trafficking, tackling climate change and the situation in Afghanistan after the Taliban took over in 2021. When the foreign ministers met in India last month, Russia’s war on Ukraine barely featured in their public remarks but the fallout for developing countries on food and fuel security remains a concern for the group, analysts say.\n\nThe forum is more important than ever for Moscow, which is eager to show that the West has failed to isolate it. The group includes the four Central Asian nations of Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan, in a region where Russian influence runs deep. Others include Pakistan, which became a member in 2017, and Iran, which is set to join on Tuesday. Belarus is also in line for membership.\n\n“This SCO meeting is really one of the few opportunities globally that Putin will have to project strength and credibility,” said Michael Kugelman, director of the Wilson Center’s South Asia Institute.\n\nNone of the member countries has condemned Russia in U.N. resolutions, choosing instead to abstain. China has sent an envoy to mediate between Russia and Ukraine, and India has repeatedly called for a peaceful resolution of the conflict.\n\nFor Putin personally, the summit presents an opportunity to show he is in control after a short-lived insurrection by Wagner mercenary chief Yevgeny Prigozhin.\n\n“Putin will want to reassure his partners that he is very much still in charge, and leave no doubt that the challenges to his government have been crushed,” said Tanvi Madan, a senior fellow at the Brookings Institution.\n\nIndia announced in May that the summit would be held online instead of in-person like last year in Samarkand, Uzbekistan, where Putin posed for photographs and dined with other leaders.\n\nFor New Delhi at least, the optics of hosting Putin and China’s leader Xi Jinping just two weeks after Modi was honored with a pomp-filled state visit by U.S. President Joe Biden would be less than ideal.\n\nAfter all the fanfare Modi received from American leaders on his recent visit, “it would have been too soon (for India) to be welcoming Chinese and Russian leaders,” Kugelman said.\n\nIndia’s relationship with Moscow has stayed strong throughout the war; it has scooped up record amounts of Russian crude and relies on Moscow for 60% of its defense hardware. At the same time, the U.S. and its allies have aggressively courted India, which they see as a counterweight to China’s growing ambitions.\n\nA key priority for India in the forum is to balance its ties with the West and the East, with the country also hosting the Group of 20 leading economies’ summit in September. It’s also a platform for New Delhi to engage more deeply with Central Asia.\n\n“India glorifies in this type of foreign policy where it’s wheeling and dealing with everybody at the same time,” said Derek Grossman, an Indo-Pacific analyst at the RAND Corporation.\n\nNew Delhi, observers say, will be looking to secure its own interests at the summit. It will likely emphasize the need to combat what it calls “cross-border terrorism” — a dig at Pakistan, whom India accuses of arming and training rebels fighting for independence of Indian-controlled Kashmir or its integration into Pakistan, a charge Islamabad denies.\n\nIt may also stress the need to respect territorial integrity and sovereignty — a charge often directed towards its other rival, China. India and China have been locked in an intense three-year standoff involving thousands of soldiers stationed along their disputed border in the eastern Ladakh region.\n\nAnalysts say China, seeking to posture itself as a global force, is becoming a dominant player in forums like the SCO, where interest for full membership from countries like Myanmar, Turkey and Afghanistan has grown in recent years.\n\n“The limitation with the SCO is that China and Russia are trying to turn it into an anti-Western grouping, and that does not fit with India’s independent foreign policy,” said Madan.\n\nThe SCO could also prove challenging for Washington and its allies in the long run.\n\n“For countries uncomfortable with the West and their foreign policies, the SCO is a welcome alternative, mainly because of the roles Russia and China play. ... I think that highlights just how relevant and concerning this group could be for a number of Western capitals, especially if it keeps expanding,” said Kugelman. ",
      "published_date": "2023-07-03",
      "url": "http://www.newindianexpress.com/world/2023/jul/03/putin-will-speak-with-leaders-of-china-and-india-in-his-first-summit-since-wagner-insurrection-2591001.html"
    },
    {
      "id": "17",
      "title": "Two soldiers killed in shootout when militants ambush troops in southwest Pakistan, military says",
      "image": "",
      "description": "There was no immediate claim of responsibility for Sunday’s ambush near Balor in Baluchistan province, but Pakistani Taliban and small separatist groups have claimed similar attacks in the past. QUETTA, Pakistan: A group of militants ambushed troops during a search operation against insurgents in a remote area in southwestern Pakistan, triggering a shootout that left an army major and a junior officer dead, the military said Monday.\n\nThere was no immediate claim of responsibility for Sunday’s ambush near Balor in Baluchistan province, but Pakistani Taliban and small separatist groups have claimed similar attacks in the past.\n\nThe military identified the two killed as Saqib Hussain and Naik Baqir Ali. Another soldier was injured, the statement said.\n\nSmall separatist groups in oil-rich Baluchistan have waged a low-level insurgency for more than two decades. Baluch nationalists initially wanted a bigger share of the provincial resources, but later their insurgency morphed into a fight for independence from the government in Islamabad.\n\nThough Pakistani authorities say they have quelled the insurgency, the violence has continued. The previous day, three policemen and a soldier were killed in militant attacks in Baluchistan, where militants from the banned Tehreek-e-Taliban Pakistan also have a strong presence. ",
      "published_date": "2023-07-03",
      "url": "http://www.newindianexpress.com/world/2023/jul/03/two-soldiers-killed-in-shootout-when-militants-ambush-troops-in-southwest-pakistan-military-says-2591083.html"
    },
    {
      "id": "16",
      "title": "Amazon Indigenous are leaving the rainforest for cities, and finding urban poverty",
      "image": "",
      "description": "About half of the 6,200 Indigenous people in the Javari Valley now live in urban centers, according to estimates by anthropologist Almério Alves Wadick. ATALAIA DO NORTE, Brazil: In 1976, Binan Tuku ventured to meet a Brazilian government’s expedition on the banks of the Itui River in a remote area of the western Amazon rainforest. After some initial suspicion, he and his father accepted machetes and soap in what was the beginning of the Matis tribe’s contact with the non-Indigenous world.\n\nNearly 50 years later, Tuku’s own son Tumi is trying to carve out a living in the impoverished city of Atalaia do Norte. Instead of the traditional blowgun, Tumi held a pastry bag in his hands while working in a bakery, and his face bore none of the tattoos or piercings characteristic of the Matis.\n\n“In the village, the quality of education is not as good as in the city,” said Tumi, 24, who hopes to go to college to study medicine or journalism. “I want to engage with non-Indigenous people, learn from the challenges I face, and perhaps one day return to my village to share my understanding of how the city functions with the elders.”\n\nThousands of Indigenous like Tumi are migrating to cities like Atalaia do Norte, some in pursuit of a better education and some drawn by a federal welfare benefit that can ensnare them in urban poverty. Their exodus is leaving villages to wither and raising concern that the world’s largest tropical rainforest — crucial to stemming the worst of climate change — will be left without its most effective guardians.\n\nAbout half of the 6,200 Indigenous people in the Javari Valley now live in urban centers, according to estimates by anthropologist Almério Alves Wadick. The Matis, one of several Indigenous peoples in the region, say almost half their 600 people now live in that city.\n\nThat number is likely to grow, said Binin Matis, who leads the Matis Indigenous Association and takes the name of his people as his surname. Binin Matis said he fears the loss of his people’s language and their exposure to drugs.\n\n“In the village, there are few people; it’s the older leaders. The youngsters are in the city,” he said. “No young Matis knows how to make a blowgun, an arrow. When the students go to the village for vacation, they don’t want to learn from the elders. They want to play soccer, have fun, and do things of the white man.”\n\nBushe Matis, president of Univaja, the main association for Indigenous peoples in the Javari Valley, worries that the migration will lead to cuts in health and education programs and the potential revocation of Indigenous territories that might then be opened for mining and drilling.\n\nThe Amazon came under heavy pressure under far-right President Jair Bolsonaro, who favored development. His single term saw a surge in illegal mining and deforestation hit a 15-year high.\n\nUnivaja recently established its own surveillance team to guard against illegal fishermen, miners and loggers — a duty previously carried out by the villages. The initiative is crucial to protect isolated Indigenous who could be imperiled by something as simple as flu carried by invaders, Bushe said.\n\nSuch tension appears to be behind last year’s killings of Indigenous expert Bruno Pereira and British journalist Dom Phillips. Pereira was in the Javari Valley assisting the creation of Univaja’s surveillance system. Four fishermen and a businessman are under arrest in the killings.\n\nLuiz Inácio Lula da Silva has sought to lessen pressure on the Amazon since defeating Bolsonaro in last year’s election. He established a Ministry of Indigenous Affairs in part to safeguard Indigenous communities. A crucial part of that is improving education, a significant challenge in remote areas of the Amazon.\n\nIndigenous families also face hostility from non-Indigenous residents who see them as competition for limited resources, especially fish.\n\n“The Indians come here, the government doesn’t give them food, and they fish on our side,” said fisherman Antonio Alves, 46. “When one of us mistreats someone, it’s for our survival.”\n\nThe Indigenous migration is being driven in part by a federal program created 20 years ago in Lula’s first term. The Bolsa Familia program was launched to provide cash to families if they immunize their children and keep them in school. Tens of thousands of Indigenous families started frequenting cities to withdraw the benefit from state bank branches.\n\nThere were dire consequences.\n\nIndigenous people unaccustomed to handling money sometimes pay more than they should for long boat trips or have their debit cards illegally retained by unscrupulous merchants as collateral for installment or credit purchases. In the city, they stay in precarious conditions, vulnerable to alcohol and disease. Often, the Bolsa Familia payout isn’t enough to get them back home.\n\n“They conclude that it’s better to stay in the city, receiving this amount and putting it towards studying since there isn’t even a complete primary education in the village,” said Wadick, the anthropologist. Indigenous leaders say village schools are in shambles from poor maintenance and lack of oversight by governments. Many Indigenous teachers have been spending long periods in the city, neglecting their work.\n\nBut the money isn’t enough to cover life in the city, either. The minimum payment is $125 per month, plus small additions for pregnant women and for children depending on age. Indigenous people often compete against each other for poorly paying jobs like collecting garbage or sweeping streets. Many endure hunger.\n\n“We need clothing, to eat every day, to pay for electricity, and water bills. If all of that were free, we could sustain ourselves with $125,” said Tumi, who recently left the bakery to work for Univaja.\n\nThe Ministry of Indigenous Peoples is seeking to rework parts of the program so Indigenous peoples don’t have to travel as often to collect payment. Proposals include extending the withdrawal period for the money and flexible payment dates.\n\nAnother major ministry goal is to improve education in Indigenous territories to reduce the incentive to leave. That’s a daunting task with high costs for huge, remote and impoverished areas.\n\nNelly Marubo, an anthropologist who is Indigenous, said her ideal is culturally adapted village schools where students have access to both Indigenous and non-Indigenous knowledge without needing to be in the city. But she was shocked by what she found when, after a five-year absence, she recently visited her native region deep in the Javari Valley to film a documentary about her life.\n\n“I always have in my mind lots of children and young people, but unfortunately, this time the visit was very sad,” she said. “I found an abandoned village with only four elderly women.” ",
      "published_date": "2023-07-03",
      "url": "http://www.newindianexpress.com/world/2023/jul/03/amazon-indigenous-are-leaving-the-rainforest-for-cities-and-finding-urban-poverty-2591090.html"
    },
    {
      "id": "15",
      "title": "Texas man found alive after he went missing in 2015",
      "image": "",
      "description": "It was not immediately known where Farias had been the last eight years, Cannon said. Police investigators had not yet spoken with Farias, 25, who remained hospitalized. HOUSTON: A Texas man who went missing as a teenager in 2015 after last being seen walking his dogs in Houston has been found alive, his family and police said Monday.\n\nPolice and firefighters found Rudolph “Rudy” Farias IV around 10 p.m. Thursday after getting a call of a person lying on the ground in front of a church in southeast Houston, police spokesman John Cannon said.\n\nIt was not immediately known where Farias had been the last eight years, Cannon said. Police investigators had not yet spoken with Farias, 25, who remained hospitalized.\n\n“What we do know is at the time of his recovery, a good Samaritan located him unresponsive and immediately called police and 911. My son Rudy is receiving the care he needs to overcome his trauma, but at this time, he is nonverbal and not able to communicate with us,” Janie Santana, Farias’ mother, said in a statement.\n\nIn a tweet Monday afternoon, Houston police said it planned on speaking with Farias and his family on Wednesday.\n\nThe news that Farias had been found was first reported in a tweet on Saturday by the Texas Center for the Missing, which was handling public communications on behalf of Farias’ family.\n\n“We do know when a loved one goes missing this is the day all families hope for and dream of – REUNIFICATION. We are thankful that Rudy has been found and receiving the care he needs,\" the centre said in a statement Monday.\n\nFarias was 17 years old when he was reported missing on March 6, 2015, after taking his two dogs for a walk near his family’s home in northeast Houston. The dogs were later found.\n\nHouston police, along with Texas Equusearch, a civilian search and recovery team, looked for Farias but found no signs of him.\n\nWhen Farias first went missing, Texas Equusearch reported that he suffered from depression and anxiety, and he might have been disoriented because he wasn’t taking his medication. Farias also had asthma and walked with a slight limp because of an injured right leg.\n\n“According to his mother he is very wary around strangers,” Texas Equusearch said in 2015.\n\nCannon said Farias’ family did report to police investigators that they had seen him in September 2018, staying behind the home of a relative.\n\nPolice investigators followed up on the 2018 sighting and went to the relative’s home. But “they could not observe him. They could not locate him,” Cannon said.\n\nSince police were not able to find Farias after the 2018 sighting, the investigation remained open as a missing person case, Cannon said.\n\nPossible sightings like the one Houston police followed up in 2018 were common in the case, said Martin Renteria, a private investigator with Checkmate Investigative Field Services in suburban Houston who had been hired by Farias’ mother a few months after Farias went missing.\n\nRenteria recalled at least a dozen such reports that turned up nothing. Renteria, who worked the case with his wife, Barbara, also followed up on possible sightings in other cities.\n\n“After a couple of years ... we finally just had to give up on it,” Renteria said Monday. He added he also considered that Farias, who had become an adult in the time he was missing, might have run away and didn’t want to be found.\n\nSantana and other family members were not available for comment Monday.\n\n“We are asking for privacy during this difficult time but will share more details as Rudy continues to heal,” Santana said in her statement. ",
      "published_date": "2023-07-04",
      "url": "http://www.newindianexpress.com/world/2023/jul/04/texas-manfound-alive-after-he-went-missing-in-2015-2591363.html"
    },
    {
      "id": "14",
      "title": "Russian fighter jet crashes into Pacific, fate of MiG-31’s 2 crew members unknown",
      "image": "",
      "description": "The military said the aircraft wasn’t carrying weapons. It didn’t immediately offer any further details or say what may have caused the crash. MOSCOW: A Russian fighter jet crashed on Tuesday during a training mission off the country’s Pacific coast and the fate of its two crew members wasn’t immediately known.\n\nThe Russian military said that the MiG-31 fell into the Avacha Bay on the southeastern coast of the Kamchatka Peninsula. It said that rescue teams were searching for its two crew members.\n\nThe military said the aircraft wasn’t carrying weapons. It didn’t immediately offer any further details or say what may have caused the crash.\n\nThe MiG-31 is a twin-engine, two-seat supersonic fighter designed to intercept enemy planes and cruise missiles at long ranges. It has been in service with the Soviet and Russian air forces since 1980s.\n\nAnother MiG-31 crashed in the Murmansk region in the Arctic in April and its crew members bailed out safely.\n\nThe Russian air force has suffered a string of crashes that some observers have attributed to a higher number of flights amid the fighting in Ukraine and tensions with the West.\n  ",
      "published_date": "2023-07-04",
      "url": "http://www.newindianexpress.com/world/2023/jul/04/russian-fighter-jet-crashes-into-pacific-fate-of-mig-31s-2-crew-members-unknown-2591384.html"
    },
    {
      "id": "13",
      "title": "Masked assailants attack journalist, lawyer in Russia’s Chechnya province",
      "image": "",
      "description": "Speaking from a hospital bed in a video, Milashina said the attack looked like a “classic abduction.” MOSCOW: Masked assailants in the Russian province of Chechnya attacked and brutally beat a prominent investigative reporter and a lawyer on Tuesday, an assault that highlighted a violent pattern of rampant human rights abuses in the region.\n\nNovaya Gazeta journalist Elena Milashina and lawyer Alexander Nemov had just arrived in Chechnya to attend the trial of Zarema Musayeva, the mother of two local activists who have challenged Chechen authorities.\n\nJust outside the airport, their vehicle was blocked by several cars and they were attacked by several unidentified masked assailants who beat them with clubs, put guns to their heads and broke their equipment.\n\nNovaya Gazeta said that Milashina sustained a brain injury and had several fingers broken, and Nemov had a deep cut on his leg. They were taken to a hospital in Chechnya’s main city, Grozny, and later to Beslan in the nearby region of North Ossetia. The newspaper said that Milashina repeatedly lost consciousness.\n\nSpeaking from a hospital bed in a video, Milashina said the attack looked like a “classic abduction.”\n\n“They threw the driver out of the car, got in, bent our heads down, tied my hands, forced me down to my knees and put a gun to my head,” she said, adding that the assailants were visibly nervous and had trouble tying her hands.\n\nA photo from a hospital showed her talking over the phone, with green antiseptic covering her face and multiple bruises on her shaven head.\n\nOfficials were considering their medical evacuation to Moscow.\n\nKremlin spokesman Dmitry Peskov said in a conference call with reporters that Russian President Vladimir Putin was informed about the incident. Peskov added that “it was a very serious assault that warrants energetic measures” from law enforcement agencies.\n\nRussian human rights ombudsperson Tatyana Moskalkova asked investigators to look into the attack on Milashina and Nemov.\n\nThe Russian Ministry for Digital Development and Mass Communications denounced the “monstrous assault” on Milashina and Nemov and said it will offer them the necessary assistance. The ministry added that it urged law enforcement agencies to thoroughly investigate the attack and punish the perpetrators.\n\nAlexander Bastrykin, head of the Investigative Committee, the country’s top state criminal investigation agency, ordered a probe into the attack.\n\nThe strong statements and a quick response from Russian authorities contrasted with a muted official reaction to previous attacks on Milashina and other journalists and human rights activists who have exposed human rights abuses in Chechnya.\n\nMilashina has long exposed human rights violations in Chechnya and has faced threats, intimidation and attacks. In 2020, Milashina and a lawyer accompanying her were beaten by a dozen people in the lobby of their hotel. Last year, she temporarily left Russia after she was threatened by Chechen authorities.\n\nShe has won a broad acclaim for her investigative reporting, which included exposing the torture and killings of gay people in Chechnya and other abuses by feared Chechen paramilitary forces.\n\nIn 2013, Milashina received an International Women of Courage Award from the U.S. Department of State.\n\nHours after Tuesday’s attack on Milashina and Nemov, a court in Grozny sentenced Zarema Musayeva to 5½ years in prison on charges of insulting and violently resisting police, an accusation that rights groups have rejected as trumped-up.\n\nMusayeva had been in custody in Grozny since Chechen security forces grabbed her from her home in the Volga River city of Nizhny Novgorod and drove her to Chechnya in January 2022. Her husband, a former judge, and her two activist sons have left Chechnya. Chechnya’s strongman regional leader, Ramzan Kadyrov, has accused the Musayev family of having terrorist links and said that they should be imprisoned or killed.\n\nThe Kremlin has relied on Kadyrov to keep the North Caucasus region stable after two devastating separatist wars. International rights groups have accused Kadyrov’s feared security forces of extrajudicial killings, torture and abductions of dissenters, but Russian authorities have stonewalled repeated demands to end abuses in Chechnya.\n\nKadyrov’s clout has risen since the start of Moscow’s campaign in Ukraine, where his security forces have taken active part. The Kremlin scrambled fighters from Chechnya to help protect Moscow from an abortive mutiny launched by mercenary chief Yevgeny Prigozhin 11 days ago, but some commentators warned that Kadyrov’s ambitions could also potentially pose a threat to federal authorities.\n\nDespite the Kremlin’s support, Kadyrov reportedly has had tense relations with some of Russia’s law enforcement agencies. The angry reaction from officials and Kremlin-connected lawmakers could signal authorities’ intentions to cut the Chechen strongman down to size.\n\nAndrei Klishas, head of the constitutional affairs committee in the upper house, said that the attack on Milashina and Nemov warrants a “tough response” from the law enforcement agencies, and another senior lawmaker, Alexander Khinshtein, denounced it as “criminal” and urged prosecutors to prioritize the case.\n  ",
      "published_date": "2023-07-04",
      "url": "http://www.newindianexpress.com/world/2023/jul/04/masked-assailants-attack-journalistlawyer-in-russias-chechnya-province-2591387.html"
    },
    {
      "id": "12",
      "title": "The Taliban are outlawing women’s beauty salons in Afghanistan",
      "image": "",
      "description": "It’s the latest curb on the rights and freedoms of Afghan women and girls, following edicts barring them from education, public spaces and most forms of employment. ISLAMABAD: The Taliban are banning women’s beauty salons in Afghanistan, a government spokesman said Tuesday.\n\nIt’s the latest curb on the rights and freedoms of Afghan women and girls, following edicts barring them from education, public spaces and most forms of employment.\n\nA spokesman for the Taliban-run Virtue and Vice Ministry, Mohammad Sidik Akif Mahajar, didn’t give details of the ban. He only confirmed the contents of a letter circulating on social media.\n\nThe ministry-issued letter, dated June 24, says it conveys a verbal order from the supreme leader, Hibatullah Akhundzada. The ban targets the capital, Kabul, and all provinces, and gives salons throughout the country a month’s notice to wind down their businesses. After that period, they must close and submit a report about their closure. The letter doesn’t give reasons for the ban.\n\nIts release comes days after Akhundzada claimed that his government has taken the necessary steps for the betterment of women’s lives in Afghanistan.\n\nIt drew criticism from human and women’s rights defenders on social media.\n\nThe United Nations on Tuesday also said it was engaged with the authorities in Afghanistan to get the ban on beauty salons reversed. The U.N. mission in Afghanistan, or UNAMA, took to Twitter, urging the Taliban to halt the edict.\n\n“This new restriction on women’s rights will impact negatively on the economy&contradicts stated support for women entrepreneurship,” it said.\n\nEarlier, one beauty salon owner said she was her family’s only breadwinner after her husband died in a 2017 car bombing. She didn’t want to be named or mention her salon for fear of reprisals.\n\nBetween eight to 12 women visit her Kabul salon every day, she said.\n\n“Day by day they (the Taliban) are imposing limitations on women,” she told The Associated Press. “Why are they only targeting women? Aren’t we human? Don’t we have the right to work or live?”\n\nDespite initial promises of a more moderate rule than during their previous stint in power in the 1990s, the Taliban have imposed harsh measures since seizing Afghanistan in August 2021 as U.S. and NATO forces were pulling out.\n\nThey have barred women from public spaces, like parks and gyms, and cracked down on media freedoms. The measures have triggered a fierce international uproar, increasing the country’s isolation at a time when its economy has collapsed — and have worsened a humanitarian crisis. ",
      "published_date": "2023-07-04",
      "url": "http://www.newindianexpress.com/world/2023/jul/04/the-taliban-are-outlawing-womens-beauty-salons-in-afghanistan-2591388.html"
    },
    {
      "id": "11",
      "title": "Simply scientifico: Bacterial excitement over extraterrestrial possibilities",
      "image": "",
      "description": "Deep down in the undersea vents, the researchers have discovered magnetotactic bacteria, which were normally only found in shallow waters or on land. Deep down in the undersea vents, the researchers have discovered magnetotactic bacteria, which were normally only found in shallow waters or on land. This has raised excitement among scientists as deep-sea hydrothermal vents attract attention not only as the birthplace of unique underwater life, but also as a potential analogous habitat for extraterrestrial life — especially on Martian terrain.The environment where the researchers sampled the bacteria is similar to what they think Mars was like when there was still flowing water on its surface, about 3 billion years ago.\n\nDeep-sea hydrothermal vents attract attention not only as the birthplace of unique underwater life, but also as a potential analogous habitat for extraterrestrial life, the researchers say, justifying their excitement about this finding. In September 2012, a team including researchers from University of Tokyo embarked on a scientific ocean cruise to the southern Mariana Trough in the western Pacific Ocean. Using a remotely operated underwater vehicle named HYPER-DOLPHIN, they collected a “chimney” from a hydrothermal vent field 2,787 meters underwater.\n\nHydrothermal vents are formed when seawater percolates underground, eventually becoming superheated — up to 400 degrees Celsius — by magma which causes it to boil back up. The erupting water deposits minerals and metals into the ocean which layer up to form chimneys, providing a warm, rich habitat for a unique life, including this magnetotactic bacteria. These organisms contain magnetosomes, iron crystals wrapped in a membrane, which align with Earth’s magnetic field and point the bacteria like a compass. This causes the bacteria to travel in the direction of Earth’s magnetic field lines leading north or south, like trains on a magnetic track.\n\nneighbourhood rebirth\nMACHINE LEARNING THAT BRINGS PAST LOCALITIES TO LIFE\nMachine learning has emerged as a boon for urban research. It is now helping in bringing back to life neighbourhoods that no longer exist, and offer people to virtually visit these locales as if they exist just as they did years, decades or even centuries ago. It is now possible because The Ohio State University researchers have developed a method to create 3D digital models of historic neighborhoods using machine learning and historic maps.\n\nThey will give researchers a resource to conduct studies that would have been nearly impossible before, such as estimating the economic loss caused by the demolition of historic neighborhoods. The research began with Sanborn maps, created to allow fire insurance companies to assess their liability in about 12,000 cities and towns in the United States during the 19th and 20th centuries. In larger cities, they were often updated regularly, They developed machine learning tools which had the capability to get details on individual buildings, the number of floors each had, their locations etc.  ",
      "published_date": "2023-07-05",
      "url": "http://www.newindianexpress.com/world/2023/jul/05/simply-scientificobacterial-excitement-over-extraterrestrial-possibilities-2591622.html"
    },
    {
      "id": "10",
      "title": "US citizenship test changes are coming, raising concerns for those with low English skills",
      "image": "",
      "description": "In December, U.S. authorities said the test was due for an update after 15 years. The new version is expected late next year. ST PAUL: The U.S. citizenship test is being updated, and some immigrants and advocates worry the changes will hurt test-takers with lower levels of English proficiency.\n\nThe naturalization test is one of the final steps toward citizenship — a months-long process that requires legal permanent residency for years before applying.\n\nMany are still shaken after former Republican President Donald Trump’s administration changed the test in 2020, making it longer and more difficult to pass. Within months, Democratic President Joe Biden took office and signed an executive order aimed at eliminating barriers to citizenship. In that spirit, the citizenship test was changed back to its previous version, which was last updated in 2008.\n\nIn December, U.S. authorities said the test was due for an update after 15 years. The new version is expected late next year.\n\nU.S. Citizenship and Immigration Services proposes that the new test adds a speaking section to assess English skills. An officer would show photos of ordinary scenarios – like daily activities, weather or food – and ask the applicant to verbally describe the photos.\n\nIn the current test, an officer evaluates speaking ability during the naturalization interview by asking personal questions the applicant has already answered in the naturalization paperwork.\n\n“For me, I think it would be harder to look at pictures and explain them,” said Heaven Mehreta, who immigrated from Ethiopia 10 years ago, passed the naturalization test in May and became a U.S. citizen in Minnesota in June.\n\nMehreta, 32, said she learned English as an adult after moving to the U.S. and found pronunciation to be very difficult. She worries that adding a new speaking section based on photos, rather than personal questions, will make the test harder for others like her.\n\nShai Avny, who immigrated from Israel five years ago and became a U.S. citizen last year, said the new speaking section could also increase the stress applicants already feel during the test.\n\n“Sitting next to someone from the federal government, it can be intimidating to talk and speak with them. Some people have this fear anyway. When it’s not your first language, it can be even more difficult. Maybe you will be nervous and you won’t find the words to tell them what you need to describe,” Avny said. “It’s a test that will determine if you are going to be a citizen. So there is a lot to lose.”\n\nAnother proposed change would make the civics section on U.S. history and government multiple-choice instead of the current oral short-answer format.\n\nBill Bliss, a citizenship textbook author in Massachusetts, gave an example in a blog post of how the test would become more difficult because it would require a larger base of knowledge.\n\nA current civics question has an officer asking the applicant to name a war fought by the U.S. in the 1900s. The applicant only needs to say one out of five acceptable answers – World War I, World War II, Korean War, Vietnam War or Gulf War – to get the question right.\n\nBut in the proposed multiple-choice format, the applicant would read that question and select the correct answer from the following choices:\n\nA. Civil War\n\nB. Mexican-American War\n\nC. Korean War\n\nD. Spanish-American War\n\nThe applicant must know all five of the wars fought by the U.S. in the 1900s in order to select the one correct answer, Bliss said, and that requires a “significantly higher level of language proficiency and test-taking skill.”\n\nCurrently, the applicant must answer six out of 10 civics questions correctly to pass. Those 10 questions are selected from a bank of 100 civics questions. The applicant is not told which questions will be selected but can see and study the 100 questions before taking the test.\n\nLynne Weintraub, a citizenship coordinator at Jones Library’s English as a Second Language Center in Massachusetts, said the proposed format for the civics section could make the citizenship test harder for people who struggle with English literacy. That includes refugees, elderly immigrants and people with disabilities that interfere with their test performance.\n\n“We have a lot of students that are refugees, and they’re coming from war-torn countries where maybe they didn’t have a chance to complete school or even go to school,” said Mechelle Perrott, a citizenship coordinator at San Diego Community College District’s College of Continuing Education in California.\n\n“It’s more difficult learning to read and write if you don’t know how to do that in your first language. That’s my main concern about the multiple-choice test; it’s a lot of reading,” Perrott said.\n\nU.S. Citizenship and Immigration Services said in a December announcement that the proposed changes “reflect current best practices in test design” and would help standardize the citizenship test.\n\nUnder federal law, most applicants seeking citizenship must demonstrate an understanding of the English language – including an ability to speak, read and write words in ordinary usage – and demonstrate knowledge of U.S. history and government.\n\nThe agency said it will conduct a nationwide trial of the proposed changes in 2023 with opportunities for public feedback. Then, an external group of experts — in the fields of language acquisition, civics and test development — will review the results of the trial and recommend ways to best implement the proposed changes, which could take effect late next year.\n\nMore than 1 million people became U.S. citizens in fiscal year 2022 — one of the highest numbers on record since 1907, the earliest year with available data — and USCIS reduced the huge backlog of naturalization applications by over 60% compared to the year before, according to a USCIS report also released in December. ",
      "published_date": "2023-07-05",
      "url": "http://www.newindianexpress.com/world/2023/jul/05/us-citizenship-test-changes-are-coming-raising-concerns-for-those-with-low-english-skills-2591666.html"
    },
    {
      "id": "9",
      "title": "Nine people shot and wounded in US as violence continues to mar July Fourth",
      "image": "",
      "description": "The victims which included two juveniles were transported to local hospitals by the Fire-based Emergency Medical Services. WASHINGTON: Nine people were shot and wounded, including two juveniles, early on Wednesday in Washington, D.C., police said. \n\nShortly before 1 a.m. police responded to a report of a shooting on Meade Street in the northeastern quadrant of the U.S. capital, Assistant Chief Leslie Parsons of the Metropolitan Police Department said in a statement on Twitter. \n\nUpon their arrival officers discovered multiple shooting victims, including a 9-year-old and a 17-year-old, Parsons said. \n\nParsons said that a dark-coloured SUV was seen driving through the neighbourhood which stopped and then shot at the victims outside enjoying the July Fourth holiday.\n\n\n#Update: Assistant Chief Leslie Parsons provides an update on the multiple people shot in the 4700 block of Meade Street, Northeast.\n\nHave info? Call 202-727-9099 or text 50411 pic.twitter.com/1aJ50vlK6y\n— DC Police Department (@DCPoliceDept) July 5, 2023\n\n\nSeveral victims were transported to local hospitals by D.C. Fire and EMS. All the victims suffered non-life-threatening injuries, Parsons said.\n\nNone have been identified. It was not immediately clear if there was more than one shooter in the vehicle and no arrests have been made. \n\nThe D.C. shooting is the latest in a string of mass shootings over a violent holiday weekend. Twenty-eight people were shot, two fatally at a block party in Baltimore early Sunday. Authorities say many of the shooting victims were under 18. \n\nOn Monday night, a gunman in a bulletproof vest has opened fire on the streets of Philadelphia, killing five people and wounding two boys, 2 and 13, before he surrendered to responding officers, police. \n\nThree people were killed and eight others injured when several men fired indiscriminately into a crowd of hundreds that had gathered in a Texas neighbourhood following a festival in the area, authorities said. The shooting in the Fort Worth neighbourhood of Como happened late Monday night, about two hours after the annual ComoFest ended.  ",
      "published_date": "2023-07-05",
      "url": "http://www.newindianexpress.com/world/2023/jul/05/nine-people-shot-and-wounded-in-usas-violence-continues-to-mar-july-fourth-2591681.html"
    },
    {
      "id": "8",
      "title": "World swelters to unofficial hottest day on record",
      "image": "",
      "description": "This global record is preliminary, pending approval from gold-standard climate measurement entities like the National Oceanic and Atmospheric Association. The entire planet sweltered to the unofficial hottest day in human recordkeeping on July 3, according to University of Maine scientists at the Climate Reanalyzer project.\n\nHigh-temperature records were surpassed on July 3 and 4 in Quebec and northwestern Canada and Peru. Cities across the US from Medford, Oregon to Tampa, Florida have been hovering at all-time highs, said Zack Taylor, a meteorologist with the National Weather Service. Beijing reported 9 straight days last week when the temperature exceeded 35 C (95 F).\n\nThis global record is preliminary, pending approval from gold-standard climate measurement entities like the National Oceanic and Atmospheric Association. But it is an indication that climate change is reaching into uncharted territory. It legitimately captures global-scale heating and NOAA will take these figures into consideration when it does its official record calculations, said Deke Arndt, director of the National Center for Environmental Information, a division of NOAA.\n\n“In the climate assessment community, I don’t think we’d assign the kind of gravitas to a single day observation as we would a month or a year,’’ Arndt said. Scientists generally use much longer measurements -- months, years, decades -- to track the Earth’s warming. In addition, this preliminary record for the hottest day is based on data that only goes back to 1979, the start of satellite record-keeping, whereas NOAA’s data goes back to 1880.\n\nBut Arndt added that we wouldn’t be seeing anywhere near record-warm days unless we were in “a warm piece of what will likely be a very warm era” driven by greenhouse gas emissions and the onset of a “robust” El Nino. An El Nino is a temporary natural warming of parts of the central Pacific Ocean that changes weather worldwide and generally makes the planet hotter.\n\nHuman-caused climate change is like an upward escalator for global temperatures, and El Nino is like jumping up while standing on that escalator, Arndt said.\n\nThe global daily average temperature for July 3 came in at 17.01 degrees Celsius or 62.6 degrees Fahrenheit, according to the University of Maine’s Climate Reanalyzer, a common tool often used by climate scientists for a good glimpse of the world’s condition. The reanalyzer is based on a NOAA computer simulation intended for forecasts that uses satellite data. It is not based on reported observations from the ground. So this unofficial record is effectively using a weather tool that is designed for forecasts, not record-keeping.\n\nThis average temperature may not seem that hot, but it’s the first time in the 44 years of this dataset that the temperature surpassed the 17-degree Celsius mark.\n\nHotter global average temperatures translate into brutal conditions for people all over the world. In the U.S., heat advisories are in effect this week for more than 30 million people in places including portions of western Oregon, inland far northern California, central New Mexico, Texas, Florida and the coastal Carolinas, according to the National Weather Service Weather Prediction Center. Excessive heat warnings are continuing across southern Arizona and California, they said.\n\nWhen the heat spikes, humans suffer health effects.\n\n“Those hotter temperatures that happen when we get hotter than normal conditions? People aren’t used to that. Their bodies aren’t used to that,” said Erinanne Saffell, the Arizona state climatologist and an expert in extreme weather and climate events.\n\nSaffell added that the risk is already high for the young and old, who are vulnerable to heat even under normal conditions.\n\n“That’s important to understand who might be at risk, making sure people are hydrated, they’re staying cool, and they’re not exerting themselves outside and taking care of those folks around you who might be at risk as well,” she said. ",
      "published_date": "2023-07-05",
      "url": "http://www.newindianexpress.com/world/2023/jul/05/world-swelters-to-unofficial-hottest-day-on-record-2591692.html"
    },
    {
      "id": "7",
      "title": "Wagner chief Prigozhin is in Russia, says Belarussian President",
      "image": "",
      "description": "President Alexander Lukashenko helped broker a deal under which Prigozhin ended his abortive mutiny on June 24 in exchange for security guarantees for himself and his soldiers. MINSK: The president of Belarus says Russian mercenary chief Yevgeny Prigozhin is in St. Petersburg and his Wagner troops have remained at the camps they stayed in before an attempted mutiny against Moscow.\n\nPresident Alexander Lukashenko helped broker a deal under which Prigozhin ended his abortive mutiny on June 24 in exchange for security guarantees for himself and his soldiers. The deal allowed Prigozhin and his troops to move to Belarus.\n\nLukashenko said last week that Prigozhin was in Belarus. He told international reporters Thursday that the mercenary chief is in St. Petersburg and Wagner troops still were at their camps. ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/wagner-chief-prigozhin-is-in-russia-says-belarussian-president-2592017.html"
    },
    {
      "id": "6",
      "title": "Indian chef killed by compatriot in Sri Lanka",
      "image": "",
      "description": "The accused, who is the manager of the restaurant at Galle Face in Colombo, attacked Ajay Kumar, who was employed at the same place as the head chef, with a sharp weapon following a brawl. COLOMBO: An Indian national has been arrested for allegedly murdering a fellow Indian at a restaurant here in Sri Lanka, police said on Thursday.\n\nThe accused, who is the manager of the restaurant at Galle Face in Colombo, attacked Ajay Kumar, who was employed at the same place as the head chef, with a sharp weapon following a brawl on Wednesday night. Both the persons were lodged together at the nearby Slave Island area, the police said.\n\nThe body of the 29-year-old victim is kept at the Colombo Hospital mortuary while the accused is in custody. The accused is scheduled to be produced before the Colombo Fort magistrate later on Thursday,  the police said.\n\nThe police arrested the suspect along with the sharp weapon used to commit the murder. ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/indian-chef-killed-by-compatriot-in-sri-lanka-2592034.html"
    },
    {
      "id": "5",
      "title": "England tourist writes apology letter after carving names on 1951-year-old Colosseum ",
      "image": "",
      "description": "Ivan Dimitrov, a 27-year-old fitness instructor living in Bristol, was tracked by the Italian Police to England, after a video of him carving ‘Ivan + Hayley 23’ went viral on social media.  A tourist from England, who carved names on to the walls of Rome’s Colosseum, has written an apology letter to the city’s mayor. \n\nReportedly, Ivan Dimitrov, a 27-year-old fitness instructor living in Bristol, was tracked by the Italian Police to England, after a video of him carving ‘Ivan + Hayley 23’ went viral on social media. \n\nThe Italian Police is said to have found Ivan after tracking him for five days. \n\nThe Colosseum is a 1,951-year-old amphitheatre monument, built in 72 AD by emperor Vespasian. \n \nThe monument was once host to gladiator fights. Initially intended to be an entertainment venue, the structure was also used to conduct animal hunts and mock naval battles. \n\nAccording to reports from Italian media, Dimitrov is being investigated for damaging a cultural heritage asset and, if convicted, faces a fine of between €2,500 and €15,000 as well as a prison sentence of two to five years.\n\nIvan, in his letter to the city’s mayor, wrote, “I admit with profound embarrassment that only after what regretfully happened did I learn of the antiquity of the monument,\" reports BBC. \n  ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/england-tourist-writes-apology-letter-after-carving-names-on-1951-year-old-colosseum-2592047.html"
    },
    {
      "id": "4",
      "title": "Seven children, two adults hurt after car crashes into school in Wimbledon",
      "image": "",
      "description": "The Metropolitan Police said the incident was not being treated as a possible extremist attack. LONDON: London police say seven children and two adults were injured Thursday when a car crashed into an elementary school on a very narrow road in Wimbledon, in southwest London.\n\nThe Metropolitan Police said the incident was not being treated as a possible extremist attack.\n\nPolice were called to The Study Preparatory School, a private all-girls school, at 9:54 a.m., along with paramedics in ground and air ambulances.\n\nThe driver of the vehicle, believed to be a Land Rover, stopped at the scene, the London police force said. No arrests were made.\n\n“There are a number of people who are critically injured, as I understand it, and given the scale of the response from emergency services ... this is a very serious incident,\" said Stephen Hammond, Wimbledon’s representative in Parliament.\n\nHammond said the section of the school where the crash took place caters to younger children between the ages of 4 and 8.\n\nThe incident occurred about a mile away from the All England Lawn Tennis and Croquet Club as it hosts the world-famous Wimbledon tennis tournament. Unlike the grand slam event, the school is located in a fairly remote area surrounded by local parks, horse trails and golf courses.\n\nPolice have extended a large cordon around the school and television pictures from overhead showed the car up against the wall of the building.\n\nDog walkers and passers-by were moved away from the scene as an air ambulance remained on the edge of Wimbledon Common, a large open space, while a number of ambulances parked nearby.\n\n“Wimbledon is like a little village,\" resident Julie Atwood said. \"For this to happen in Wimbledon is unheard of. It’s terrible.” ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/seven-children-two-adults-hurt-after-car-crashes-into-school-in-wimbledon-2592050.html"
    },
    {
      "id": "3",
      "title": "UK court rejects government bid to withhold Boris Johnson’s messages from COVID-19 inquiry",
      "image": "",
      "description": "The judges who ruled in the Cabinet Office’s case said the requested documents included WhatsApp messages exchanged between officials who were dealing with COVID-19. LONDON: A UK court on Thursday rejected the British government’s request to keep former Prime Minister Boris Johnson’s unredacted WhatsApp messages and diaries from being made public at an official COVID-19 inquiry.\n\nThe Cabinet Office took the unusual step of bringing a legal challenge after the retired judge chairing the inquiry into Britain’s handling of the coronavirus pandemic ordered the Conservative government to release full copies of Johnson’s documents.\n\nGovernment officials argued that the inquiry did not have the legal power to force them to release documents and messages that they said were “unambiguously irrelevant” to how the government handled COVID-19.\n\nBut lawyers for the inquiry said the idea that civil servants could decide what material was relevant would undermine public confidence in the process.\n\nThe judges who ruled in the Cabinet Office’s case said the requested documents included WhatsApp messages exchanged between officials who were dealing with COVID-19. They added that Johnson’s diaries and notebooks were also “very likely to contain information about decision-making” relating to the pandemic.\n\nA spokesperson for Heather Hallett, the retired judge leading the COVID investigation, said after Thursday’s ruling that the Cabinet Office must hand over Johnson’s material by Monday.\n\nThe government said it would comply fully with the ruling and work with the inquiry to ensure the privacy of involved individuals is protected.\n\nJohnson, who was prime minister during the COVID-19 pandemic, agreed in late 2021 to hold an inquiry into how the government handled the spread of the virus.\n\nJohnson handed over some of his unredacted notebooks along with diaries and WhatsApp messages to the inquiry in late May.\n\nOpposition parties and critics slammed the Conservative government for seeking to dodge scrutiny. The COVID-19 Bereaved Families for Justice group said it was a “disgrace” that the Cabinet Office tried to obstruct the work of the inquiry.\n\n“This judicial review was a desperate waste of time and money,” the group’s spokesperson, Deborah Doyle, said. “The inquiry needs to get to the facts if the country is to learn lessons that will save lives in the future.”\n\nCOVID-19 was recorded as a cause of death for almost 227,000 people in the UK, one of the highest pandemic death tolls in Europe, and critics have questioned whether blunders or wrong decisions taken by Britain’s government have contributed to that. The bereaved families of some of the people who died pressured the government to authorize an inquiry.\n\nHallett has the power to summon evidence and witnesses, including senior politicians, to testify under oath at public hearings, which began last month. ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/uk-court-rejects-government-bid-to-withhold-boris-johnsons-messages-from-covid-19-inquiry-2592072.html"
    },
    {
      "id": "2",
      "title": "Global heat is just the latest 2023 extreme that shows an Earth in crisis",
      "image": "",
      "description": "Dying coral reefs, more intense Nor’easters and the wildfire smoke that has choked much of North America this summer are among the many other signals of climate distress. As a warming Earth simmered into worrisome new territory this week, scientists said the unofficial records being set for average planetary temperature were a clear sign of how pollutants released by humans are warming their environment. But the heat is also just one way the planet is telling us something is gravely wrong, they said.\n\n“Heat sets the pace of our climate in so many ways ... it’s never just the heat,” said Kim Cobb, a climate scientist at Brown University.\n\nDying coral reefs, more intense Nor’easters and the wildfire smoke that has choked much of North America this summer are among the many other signals of climate distress.\n\n“The increasing heating of our planet caused by fossil fuel use is not unexpected, but it is dangerous for us humans and for the ecosystems we depend on. We need to stop it, fast,” said Stefan Rahmstorf of the Potsdam Institute for Climate Impact Research.\n\nSome other recent “firsts” and events that indicate climate change has entered uncharted territory:\n\nOcean Warming\n\nMost of the planet is covered by oceans, which have absorbed 90% of the recent warming caused by planet-warming gases such as carbon dioxide and methane. In April, global ocean temperature soared to 69.98 degrees Fahrenheit (21.1 degrees Celsius), which was attributed to the combination of greenhouse gas emissions and the early El Nino formation. Newly published data from the Copernicus Climate Change Service documented “exceptionally warm” ocean temperatures in the North Atlantic with “extreme” marine heat waves near Ireland, the U.K., and in the Baltic Sea.\n\nWildfire Smoke\n\nSeveral rounds of wildfire smoke originating from northern Canada brought dangerous air quality levels to eastern North America. The high levels of wildfire smoke have become familiar on the West Coast, but scientists say that climate change will make wildfires and smoke more likely and intense and that the East Coast will see more of it.\n\nEl Nino Arrives Early\n\nThe current El Nino — a period of warming Pacific Ocean waters — formed a month or two earlier than usual, replacing a La Nina that, with its cooling of Pacific waters, served as a damper on global temperatures. That means it will have more time than usual to strengthen. The World Meteorological Organization predicts there is a 98% chance that at least one of the next five years will be the warmest on record, beating 2016 when an exceptionally strong El Nino was present.\n\nShrinking Antarctic Sea Ice\n\nScientists are watching Antarctic sea ice shrink to record lows. The 4.5 million square miles (11.7 million square kilometers) covered by the sheet on June 27 was almost 1 million square miles (2.6 million square kilometers) less than average for that date for the period from 1981-2010, according to the National Snow and Ice Data Center.\n\nPut another way, an area nearly four times the size of Texas was gone from the ice sheet. ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/global-heat-is-just-the-latest-2023-extreme-that-shows-an-earth-in-crisis-2592119.html"
    },
    {
      "id": "1",
      "title": "Guantanamo detainees tell first independent visitor about scars from torture and hopes to leave",
      "image": "",
      "description": "The United Nations had tried for many years to send an independent investigator, but was turned down by the administrations of George W Bush, Barack Obama and Donald Trump. UNITED NATIONS: At the US detention center at Guantanamo Bay, the ageing men known by their serial numbers arrived at the meeting shackled. Every single one told the visitor — for many the first independent person they had talked to in 20 years — “You came too late.”\n\nBut they still talked, about the scant contacts with their families, their many health problems, the psychological and physical scars of the torture and abuse they experienced, and their hopes of leaving and reuniting with loved ones.\n\nFor the first time since the facility in Cuba opened in 2002, a US president had allowed a United Nations independent investigator, Fionnuala Ní Aoláin, to visit.\n\nShe said in an interview with The Associated Press that it’s true she came too late, because a total of 780 Muslim men were detained there following the 9/11 terrorist attacks that killed nearly 3,000 people, and today there are just 30 remaining.\n\nThe United Nations had tried for many years to send an independent investigator, but was turned down by the administrations of George W Bush, Barack Obama and Donald Trump.\n\nNí Aoláin praised President Joe Biden’s administration for allowing “critical voices” into the facility. And she expressed hope other governments that have barred UN special investigators will follow Biden’s example.\n\nThe Belfast-born law professor said she believes the cross-section of “high-value” and “non-high value” detainees she met with — the Biden administration gave her free rein to talk to anyone — “recognized the importance of sitting in a room with me.”\n\n“But I think there was a shared understanding that at this point, with only 30 of them left, while I can make recommendations and they will hopefully substantially change the day-to-day experience of these men, the vast majority of their lives was lived in a context where people like myself and the U.N. had no influence,” she said.\n\nNí Aoláin, concurrently a law professor at the University of Minnesota and at Queens University in Belfast, said she has visited many high-security prisons during her six years as a UN human rights investigator, including some built for those convicted of terrorism and related serious offenses.\n\nBut “there is really no population on Earth like this population that came to Guantanamo Bay, Cuba, in the circumstances in which they came, rendered across borders,” she said.\n\nIn her report issued June 26, Ní Aoláin said even though the attacks on Sept. 11, 2001, were “crimes against humanity,” the treatment of the detainees at Guantanamo was unjustified. The vast majority were brought there without cause and had no relationship to the terrorist attacks, she wrote, adding that all of the men still alive suffer from psychological and physical trauma.\n\nThe Biden administration, which has said it wants to close the Guantanamo facility, said in a statement attached to the report that Ní Aoláin’s findings “are solely her own” and “the United States disagrees in significant respects with many factual and legal assertions” but it will carefully review her recommendations.\n\nIn last week’s interview with the AP, Ní Aoláin talked about what she saw on a personal level.\n\nShe said all US personnel are required to address detainees by their internment serial number, not their name, which she called “dehumanizing.”\n\nNí Aoláin said she is especially concerned about three detainees who have not been charged and “live in a complete legal limbo,” which is “completely inconsistent with international law.” Of the others, 16 have been cleared to leave but haven’t found a country willing to take them and 11 still have cases pending before US military commissions.\n\nWhen the detainees were brought to meet her, they were shackled, which she said is not standard procedure even for those convicted of terrorism. Under international law, she said, people cannot be shackled except for imperative security reasons, and in her view at Guantanamo it should be prohibited and used only as a last resort in exceptional circumstances.\n\n“You’re dealing with an elderly vulnerable population who are incarcerated,” Ní Aoláin said.\n\n“These men, because they are torture victim survivors, they have difficulties concentrating, they have challenges with recurrent memory, somatic pain. Many of them struggle with mobility and other issues,” including permanent disabilities, traumatic brain injuries, chronic pain and gastrointestinal and urinary problems, she said.\n\nNí Aoláin said force-feeding has been an ongoing practice in response to their hunger strikes, which along with suicidal ideas and self-harm “speak to the core finding of this report — which is the deep and profound despair of individuals who’ve been held without trial for 20 years, have not seen their family members, have had no access to the outside world” except their lawyers until she visited in February for four days.\n\nPractices like using restraints cause added psychological distress for many of the detainees, she said.\n\nFor the report, Ni Aoláin also interviewed victims, survivors and families of those killed on 9/11, and she met with some of the 741 men who already had been released from Guantanamo, including approximately 150 resettled in 29 countries. The rest returned home, and 30 men have since died.\n\nWhat the men still at Guantanamo and those who have been released need most, she said, “is torture rehabilitation — every single one — and the U.S. is a leader in torture rehabilitation.”\n\nShe welcomed Biden’s “extraordinary statement” on June 26, the International Day in Support of Victims of Torture, reaffirming U.S. opposition “to all forms of inhumane treatment and our commitment to eliminating torture and assisting torture survivors as they heal and in their quests for justice.”\n\n“That tells me … there is a capacity to remedy here,” she said. Rehabilitation is critical for all torture victims, she said, but also “for ourselves, because that’s what democracies do. … We look at our past, we take it onboard, and we address it, because democracies are self-correcting.”\n\nNí Aoláin called the communal meals and communal prayer for all detainees — which the US emphasizes —very important.\n\n“The men themselves are enormously important to each other in their rehabilitation,” she said. “There is an enormous bond of support and fraternity and care amongst these men for each other.”\n\nNi Aoláin noted the detainees have some privileges — they are able to watch television and read books — and there are language classes, some opportunities to learn about computers and art lessons.\n\nShe said she was “really gratified” the Biden administration recently decided to allow detainees to take as much of their artwork “as is practicable” when they leave.\n\n“This creative work is enormously important to these men,” she said, noting that a detainee who recently returned to Pakistan had an art exhibition in Karachi some weeks ago.\n\nAmong the many recommendations Ní Aoláin’s report makes is for torture rehabilitation and additional education and training, especially for those cleared to leave.\n\n“These men are going to go out into the world,” she said. “Many of them were young men when they were detained and rendered to Guantanamo Bay, Cuba. They’re now old men, middle-aged men, who have to figure out how to go back into life, and many of them have huge anxieties” about providing for their families and about being fathers after so many years. ",
      "published_date": "2023-07-06",
      "url": "http://www.newindianexpress.com/world/2023/jul/06/guantanamo-detainees-tell-first-independent-visitor-about-scars-from-torture-and-hopes-to-leave-2592121.html"
    }
  ],
  "success": 1
}
